RandMental/LTC---4-Zone-Temperature-Controller/ESP32_Victron_Dual_DS1820_MQTT_7735_v2/ESP32_Victron_Dual_DS1820_MQTT_7735_v2.ino
/*
 * =============================================================================
 * Victron Temperature Monitor - 4-Channel Production Version
 * =============================================================================
 *
 * ESP32-S3-based temperature monitoring system for Victron solar equipment.
 * Monitors 4x DS18B20 sensors, controls 4x cooling fans, publishes to MQTT,
 * and displays status on ST7735 TFT.
 *
 * Original project: https://RandomNerdTutorials.com/esp32-mqtt-publish-ds18b20-temperature-arduino/
 *
 * History:
 *   DdR - 18-03-2024  Initial version with two DS1820 sensors
 *   DdR - 30-03-2024  Added ST7735 TFT display
 *   DdR - 26-01-2026  Added relay fan control, updated libraries
 *   DdR - 27-01-2026  Switched to ESP32MQTTClient library
 *   DdR - 27-01-2026  Production hardening (watchdog, filtering, reconnection)
 *   DdR - 27-01-2026  Upgraded to 4 sensors and 4 fans
 *   DdR - 28-01-2026  Added sensor address assignment mode
 *   DdR - 28-01-2026  GPIO 15->14 for OneWire (strapping pin fix), watchdog init fix
 *   DdR - 29-01-2026  Migrated to ESP32-S3-DevKitC-1 (44-pin), GPIO remapping
 *   DdR - 30-01-2026  Fixed: Capacitive touch on GPIO6, explicit SPI init for ST7735
 *   DdR - 05-02-2026  Update code for ILI9341 240x320 3.2" display
 *
 * Features:
 *   - 4x DS18B20 temperature sensors with moving average filter
 *   - 4x Fan relay outputs with hysteresis control
 *   - DHT22 ambient temperature/humidity sensor
 *   - ST7735 1.8" 128x160 TFT display with status bar
 *   - MQTT publishing with QoS 1 and Last Will Testament
 *   - Hardware watchdog timer (30s timeout)
 *   - Non-blocking design throughout
 *   - Exponential backoff for WiFi reconnection
 *   - Graceful degradation on sensor failures
 *   - Persistent boot counter
 *   - Heap monitoring for memory leak detection
 *   - Button-activated sensor address assignment mode
 *   - NVS persistence for sensor addresses
 *
 * =============================================================================
 */

// ================================ INCLUDES ================================
#include "config.h"
#include "icons.h"
#include <Arduino.h>
#include <stdarg.h>
#include <string>
#include <WiFi.h>
#include <ESP32MQTTClient.h>
#include <OneWire.h>
#include <DallasTemperature.h>
#include <SPI.h>
#include <Adafruit_GFX.h>
#include <Adafruit_ILI9341.h>
#include <XPT2046_Touchscreen.h>
#include <Fonts/FreeMonoBold12pt7b.h>
#include <Fonts/FreeMonoBold24pt7b.h>
#include <time.h>
#include <DHT.h>
#include <esp_task_wdt.h>
#include <esp_idf_version.h>
#include <Preferences.h>
#include <ESPAsyncWebServer.h>
#include <Update.h>
#include <SD.h>

// ================================ VERSION INFO ================================
#define FIRMWARE_VERSION "2.2.2"
#define BUILD_DATE __DATE__
#define BUILD_TIME __TIME__
#define DISPLAY_SCALE 1


// ================================ DEBUG CONFIGURATION ================================
// Debug level is defined in config.h

#if DEBUG_LEVEL >= 1
#define LOG_ERROR(fmt, ...) logMessage("ERROR", fmt, ##__VA_ARGS__)
#else
#define LOG_ERROR(fmt, ...)
#endif

#if DEBUG_LEVEL >= 2
#define LOG_WARN(fmt, ...) logMessage("WARN", fmt, ##__VA_ARGS__)
#else
#define LOG_WARN(fmt, ...)
#endif

#if DEBUG_LEVEL >= 3
#define LOG_INFO(fmt, ...) logMessage("INFO", fmt, ##__VA_ARGS__)
#else
#define LOG_INFO(fmt, ...)
#endif

#if DEBUG_LEVEL >= 4
#define LOG_DEBUG(fmt, ...) logMessage("DEBUG", fmt, ##__VA_ARGS__)
#else
#define LOG_DEBUG(fmt, ...)
#endif

// ================================ FONTS ================================
#define font_small &FreeMonoBold12pt7b
#define font_large &FreeMonoBold24pt7b

// =============================================================================
// Layout for 240x320 ILI9342 display (scaled 2x from 128x160 original)
// All Y values are baselines for text positioning with custom fonts
// =============================================================================

// Status bar (top row: WiFi icon, IP address, SD icon, MQTT)
#define STATUSBAR_Y 0
#define STATUSBAR_HEIGHT 30
#define WIFI_ICON_X 6
#define WIFI_ICON_Y 1
#define IP_TEXT_X 44
#define IP_TEXT_Y 11
#define SD_ICON_X 162
#define SD_ICON_Y 7

// Time display (large centered time)
#define TIME_ROW_Y 30
#define TIME_ROW_HEIGHT 60
#define TIME_BASELINE_Y 80  // Baseline for 24pt font

// Date display (smaller, below time)
#define DATE_ROW_Y 90
#define DATE_ROW_HEIGHT 40
#define DATE_BASELINE_Y 120  // Baseline for 12pt font

// Device name row (name + fan icon inline)
#define NAME_ROW_Y 140
#define NAME_ROW_HEIGHT 50
#define NAME_BASELINE_Y 170  // Baseline for 12pt font

// Temperature row (icon + large temp value)
#define TEMP_ROW_Y 160
#define TEMP_ROW_HEIGHT 80
#define TEMP_BASELINE_Y 230  // Baseline for 24pt font

// Humidity row (ambient screen only)
#define HUM_ROW_Y 240
#define HUM_ROW_HEIGHT 80
#define HUM_BASELINE_Y 300  // Baseline for 24pt font

// Test/Assignment mode screens
#define TITLE_Y 30
#define TITLE_LINE_Y 50
#define PROGRESS_Y 80
#define MODE_NAME_Y 140
#define STATUS_Y 200
#define BOX_Y 260
#define BOX_SIZE 40
#define BOX_SPACING 50

// Icon dimensions defined in icons.h

// Fan relay pins array (uses defines from config.h)
const uint8_t FAN_RELAY_PINS[NUM_FANS] = { FAN_RELAY_0, FAN_RELAY_1, FAN_RELAY_2, FAN_RELAY_3 };

// Note: Fan output states (fanOnState/fanOffState) are set at runtime from cfg.fanActiveLow
// Note: Device names, topics, thresholds, and NTP config moved to RuntimeConfig (cfg.*)

// ================================ SENSOR ADDRESSES ================================
/*
 * DS18B20 1-Wire sensor addresses.
 * Loaded from config.h. Use assignment mode to discover new addresses.
 * New addresses are printed to Serial - copy them to config.h.
 *
 * NOTE: Sensors with address starting with 0x28,0x00,0x00 are placeholders.
 */
DeviceAddress sensorAddresses[NUM_TEMP_SENSORS] = {
  SENSOR_ADDR_0,  // Sensor 0: MPPT_W
  SENSOR_ADDR_1,  // Sensor 1: MPPT_E
  SENSOR_ADDR_2,  // Sensor 2: MultiPlus_1
  SENSOR_ADDR_3   // Sensor 3: Batteries
};

// ================================ GLOBAL OBJECTS ================================
OneWire oneWire(ONEWIRE_PIN);
DallasTemperature sensors(&oneWire);
DHT dht(DHTPIN, DHT22);
// ILI9342 3.2" 240x320 display (hardware SPI)
Adafruit_ILI9341 tft = Adafruit_ILI9341(TFT_CS, TFT_DC, TFT_RST);
// XPT2046 touchscreen (shares SPI bus, separate CS)
XPT2046_Touchscreen touch(TCH_CS, TCH_IRQ);

// Color definitions (use ST77XX for compatibility with both displays)
#define COLOR_BLACK 0x0000
#define COLOR_WHITE 0xFFFF
#define COLOR_RED 0xF800
#define COLOR_GREEN 0x07E0
#define COLOR_BLUE 0x001F
#define COLOR_CYAN 0x07FF
#define COLOR_MAGENTA 0xF81F
#define COLOR_YELLOW 0xFFE0
#define COLOR_ORANGE 0xFD20

ESP32MQTTClient mqttClient;
Preferences preferences;

