RandMental/LTC---4-Zone-Temperature-Controller/ESP32_Victron_Dual_DS1820_MQTT_7735_v2/ESP32_Victron_Dual_DS1820_MQTT_7735_v2.ino
// ================================ SENSOR DATA STRUCTURE ================================
/**
 * @brief Stores sensor data with moving average filtering
 *
 * Provides noise rejection through averaging and error detection
 * through consecutive error counting.
 */
struct SensorData {
  float values[FILTER_SAMPLES];  // Circular buffer for readings
  uint8_t index;                 // Current position in buffer
  uint8_t validCount;            // Number of valid readings in buffer
  uint8_t errorCount;            // Consecutive error count
  float filtered;                // Filtered (averaged) value
  bool valid;                    // True if sensor is working
  bool enabled;                  // True if sensor is configured

  void init() {
    for (int i = 0; i < FILTER_SAMPLES; i++) values[i] = 0;
    index = 0;
    validCount = 0;
    errorCount = 0;
    filtered = 0;
    valid = false;
    enabled = true;
  }

  /**
   * @brief Add a new reading to the filter
   * @param value Temperature reading (or invalid marker)
   */
  void addReading(float value) {
    if (value >= TEMP_MIN_VALID && value <= TEMP_MAX_VALID) {
      values[index] = value;
      index = (index + 1) % FILTER_SAMPLES;
      if (validCount < FILTER_SAMPLES) validCount++;
      errorCount = 0;
      valid = true;

      // Calculate moving average
      float sum = 0;
      for (uint8_t i = 0; i < validCount; i++) sum += values[i];
      filtered = sum / validCount;
    } else {
      errorCount++;
      if (errorCount >= SENSOR_ERROR_THRESHOLD) {
        valid = false;
      }
    }
  }
};

// ================================ RUNTIME CONFIGURATION ================================
/**
 * @brief Runtime configuration loaded from SD card INI file
 *
 * All fields are initialized from compiled #define defaults.
 * If an SD card with /config.ini is present, values are overridden at boot.
 */
struct RuntimeConfig {
  // WiFi
  char wifiSsid[33];
  char wifiPassword[65];
  uint32_t wifiConnectTimeoutMs;
  uint32_t wifiReconnectIntervalMs;
  // MQTT
  char mqttHost[65];
  uint16_t mqttPort;
  char mqttUser[33];
  char mqttPassword[33];
  char mqttClientName[33];
  char mqttBaseTopic[33];
  uint8_t mqttQos;
  bool mqttRetain;
  // MQTT topic strings (built at runtime from mqttBaseTopic)
  char mqttPubStatus[64];
  char mqttPubWifiRssi[64];
  char mqttPubWifiIp[64];
  char mqttPubUptime[64];
  char mqttPubHeapFree[64];
  char mqttPubVersion[64];
  char mqttPubAmbTemp[64];
  char mqttPubAmbHum[64];
  // NTP
  char ntpServer[65];
  long gmtOffsetSec;
  int daylightOffsetSec;
  // Devices (4 sensors)
  char deviceNames[4][17];
  char deviceTopics[4][17];
  // Temperature thresholds
  float tempFanOn[4];
  float tempFanOff[4];
  float tempFanHysteresis;
  float tempMinValid;
  float tempMaxValid;
  // Timing
  uint32_t sensorInterval;
  uint32_t displayInterval;
  uint32_t mqttInterval;
  uint32_t statusInterval;
  uint32_t ntpInterval;
  // Sensor addresses
  uint8_t sensorAddresses[4][8];
  // Display
  uint8_t tftRotation;
  char startupLine1[21];
  char startupLine2[21];
  char startupLine3[21];
  // Fan
  bool fanActiveLow;
  // Watchdog
  uint32_t wdtTimeoutS;
  // SD status
  bool sdCardPresent;
  bool configLoaded;
};

RuntimeConfig cfg;    // Global runtime config
uint8_t fanOnState;   // Runtime: LOW or HIGH (replaces fanOnState #define)
uint8_t fanOffState;  // Runtime: HIGH or LOW (replaces fanOffState #define)

// ================================ OPERATING MODES ================================
enum OperatingMode {
  MODE_STARTUP,           // Initial boot screen
  MODE_NORMAL,            // Standard operation
  MODE_TEST_FANS,         // Testing all fans
  MODE_SENSOR_CLEAR_BUS,  // Waiting for sensors to be removed
  MODE_SENSOR_ASSIGNMENT  // Assigning sensor addresses one by one
};

// ================================ SYSTEM STATE ================================
/**
 * @brief Central state structure for the entire system
 *
 * Consolidates all state variables for easy initialization and access.
 */
struct SystemState {
  // Connection state
  bool wifiConnected;
  bool mqttConnected;
  int wifiRSSI;
  uint32_t wifiReconnectAttempts;

  // Timing (using uint32_t for millis() values)
  uint32_t lastMQTTPublish;
  uint32_t lastDisplayUpdate;
  uint32_t lastNTPSync;
  uint32_t lastSensorRead;
  uint32_t lastStatusPublish;
  uint32_t lastWifiCheck;
  uint32_t bootTime;

  // Display
  uint8_t displayScreen;

  // Sensors and fans
  SensorData tempSensors[NUM_TEMP_SENSORS];
  bool fanStates[NUM_FANS];
  SensorData ambientTemp;
  SensorData ambientHum;

  // Statistics
  uint32_t bootCount;
  uint32_t publishCount;
  uint32_t sensorErrors;
  uint32_t minHeap;

  // Operating mode
  OperatingMode operatingMode;

  // Button state
  bool buttonPressed;
  uint32_t buttonPressStartTime;

  // Test fans mode
  uint32_t testFansStartTime;
  uint8_t currentTestFan;  // Which fan is being tested (0-3)
  bool testFanPhase;       // true = fan ON, false = pause

  // RGB LED
  uint32_t lastRgbPulse;
  uint8_t rgbColorIndex;

  // Sensor assignment mode
  uint8_t currentSensorIndex;
  uint32_t assignmentStepStartTime;
  bool addressesModified;
  bool sensorDetectedForStep;         // Sensor found for current step
  DeviceAddress detectedAddress;      // Address of detected sensor
  float detectedTemperature;          // Temperature of detected sensor
  bool confirmButtonWasPressed;       // Button was pressed (for confirmation)
  uint32_t confirmButtonPressStart;   // When confirm button was first pressed
  uint32_t confirmButtonReleaseTime;  // When confirm button was released
  bool awaitingConfirmRelease;        // Waiting for 1s after button release
  bool awaitingSensorRemoval;         // Waiting for sensor to be removed before next

  void init() {
    wifiConnected = false;
    mqttConnected = false;
    wifiRSSI = -100;
    wifiReconnectAttempts = 0;
    lastMQTTPublish = 0;
    lastDisplayUpdate = 0;
    lastNTPSync = 0;
    lastSensorRead = 0;
    lastStatusPublish = 0;
    lastWifiCheck = 0;
    bootTime = 0;
    displayScreen = 0;

