RandMental/LTC---4-Zone-Temperature-Controller/ESP32_Victron_Dual_DS1820_MQTT_7735_v2/ESP32_Victron_Dual_DS1820_MQTT_7735_v2.ino
    for (int i = 0; i < NUM_TEMP_SENSORS; i++) {
      tempSensors[i].init();
    }
    for (int i = 0; i < NUM_FANS; i++) {
      fanStates[i] = false;
    }

    ambientTemp.init();
    ambientHum.init();
    bootCount = 0;
    publishCount = 0;
    sensorErrors = 0;
    minHeap = ESP.getFreeHeap();

    operatingMode = MODE_STARTUP;
    buttonPressed = false;
    buttonPressStartTime = 0;
    testFansStartTime = 0;
    currentTestFan = 0;
    testFanPhase = false;
    lastRgbPulse = 0;
    rgbColorIndex = 0;
    currentSensorIndex = 0;
    assignmentStepStartTime = 0;
    addressesModified = false;
    sensorDetectedForStep = false;
    memset(detectedAddress, 0, sizeof(detectedAddress));
    detectedTemperature = 0.0f;
    confirmButtonWasPressed = false;
    confirmButtonPressStart = 0;
    confirmButtonReleaseTime = 0;
    awaitingConfirmRelease = false;
    awaitingSensorRemoval = false;
  }
} state;

/**
 * @brief Display cache to prevent unnecessary screen updates
 *
 * Tracks previously displayed values to enable partial screen updates.
 */
struct DisplayCache {
  // Status bar cache
  bool wifiConnected;
  int wifiRSSI;
  bool mqttConnected;
  bool sdCardShown;
  char lastIP[16];

  // Time cache
  int8_t hour;
  int8_t minute;
  int8_t day;
  int8_t month;
  int16_t year;

  // Sensor display cache
  int8_t lastScreen;  // -1 = uninitialized
  float lastTemp;
  bool lastFanState;
  bool lastSensorValid;
  bool lastSensorEnabled;

  // Ambient cache
  float lastAmbientTemp;
  float lastAmbientHum;
  bool lastAmbientTempValid;
  bool lastAmbientHumValid;

  void init() {
    wifiConnected = false;
    wifiRSSI = -999;
    mqttConnected = false;
    sdCardShown = false;
    lastIP[0] = '\0';
    hour = -1;
    minute = -1;
    day = -1;
    month = -1;
    year = -1;
    lastScreen = -1;
    lastTemp = -999.0f;
    lastFanState = false;
    lastSensorValid = false;
    lastSensorEnabled = false;
    lastAmbientTemp = -999.0f;
    lastAmbientHum = -999.0f;
    lastAmbientTempValid = false;
    lastAmbientHumValid = false;
  }
} displayCache;

// MQTT URI and topic buffers
char mqttUri[128];
char mqttTopicTemp[64];
char mqttTopicFan[64];

// ================================ WEB SERVER ================================
AsyncWebServer webServer(80);
bool webServerInitialized = false;

// ================================ ICONS ================================
// Icon bitmaps and dimension defines are in icons.h

// ================================ FUNCTION PROTOTYPES ================================
void logMessage(const char* level, const char* fmt, ...);
void initWatchdog();
void feedWatchdog();
void loadPreferences();
void savePreferences();
void initDisplay();
void initSensors();
void initRelays();
void initWiFi();
void initMQTT();
void initNTP();
void syncNTP();
void readAllSensors();
void updateFans();
void updateDisplay();
void publishTelemetry();
void publishStatus();
void handleWiFi();
void displayStatusBar();
void displayDevice(uint8_t deviceNum);
void displayLocalTime();
void displayAmbient();
uint16_t getTemperatureColor(float temp, uint8_t deviceIndex);
bool isSensorAddressValid(uint8_t index);
void updateHeapStats();

// Configuration and SD card functions
void initConfigDefaults();
void buildMqttTopics();
bool initSDCard();
void checkSDCard();
void promptLoadConfig();
bool loadConfigFromSD();
bool writeConfigToSD();
void applyConfigKey(const char* key, const char* value);
bool parseSensorAddress(const char* str, uint8_t* addr);
void displayStartupScreen();
void displayOtaStatus(const char* line1, const char* line2, uint16_t color);

// Touch and mode functions
void initTouch();
bool isInputActive();
uint8_t checkButton();
void initRgbLed();
void updateRgbLed();
void loadSensorAddresses();
void saveSensorAddresses();
bool hasStoredSensorAddresses();
void enterTestFansMode();
void handleTestFansMode();
void displayTestFansScreen();
void enterSensorAssignmentMode();
void displaySensorAssignmentScreen();
void displayAssignmentStatusArea();
void handleClearBusMode();
void handleSensorAssignmentMode();
void advanceToNextSensor();
void exitAssignmentMode(bool saveAndReboot);
void resetStepState();

// Web server functions
void initWebServer();
String generateHtmlPage();
void handleRoot(AsyncWebServerRequest* request);
void handleFanTest(AsyncWebServerRequest* request);
void handleNotFound(AsyncWebServerRequest* request);
void handleAssignSensors(AsyncWebServerRequest* request);
void handleSaveConfig(AsyncWebServerRequest* request);
void handleFirmwareUpload(AsyncWebServerRequest* request, String filename, size_t index, uint8_t* data, size_t len, bool final);
void handleFirmwareUploadComplete(AsyncWebServerRequest* request);
void handleConfigUpload(AsyncWebServerRequest* request, String filename, size_t index, uint8_t* data, size_t len, bool final);
void handleConfigUploadComplete(AsyncWebServerRequest* request);

// Callback functions
void WiFiEvent(WiFiEvent_t event);
void onMqttConnect(esp_mqtt_client_handle_t client);
void onMqttMessage(const std::string& topic, const std::string& payload);

// ================================ LOGGING ================================
/**
 * @brief Log message with timestamp and level
 * @param level Log level string (ERROR, WARN, INFO, DEBUG)
 * @param fmt Printf-style format string
 */
void logMessage(const char* level, const char* fmt, ...) {
  char timestamp[12] = "00:00:00";
  struct tm timeinfo;

  // Use 10ms timeout to avoid blocking if NTP hasn't synced
  if (getLocalTime(&timeinfo, 10)) {
    strftime(timestamp, sizeof(timestamp), "%H:%M:%S", &timeinfo);
  }

  char message[128];
  va_list args;
  va_start(args, fmt);
  vsnprintf(message, sizeof(message), fmt, args);
  va_end(args);

  Serial.printf("[%s] [%s] %s\n", timestamp, level, message);
}

// ================================ WATCHDOG ================================
void initWatchdog() {
  esp_task_wdt_config_t wdt_config = {
    .timeout_ms = WDT_TIMEOUT_S * 1000,
    .idle_core_mask = (1 << portNUM_PROCESSORS) - 1,
    .trigger_panic = true
  };

  // Deinit first since TWDT is enabled by default in IDF 5.0+
  esp_task_wdt_deinit();

  // Re-initialize with our custom configuration
  esp_err_t result = esp_task_wdt_init(&wdt_config);
  if (result != ESP_OK) {
    LOG_ERROR("Watchdog init failed: %d", result);
    return;
  }

  esp_task_wdt_add(NULL);
  LOG_INFO("Watchdog initialized (%ds timeout)", WDT_TIMEOUT_S);
}

