RandMental/LTC---4-Zone-Temperature-Controller/ESP32_Victron_Dual_DS1820_MQTT_7735_v2/ESP32_Victron_Dual_DS1820_MQTT_7735_v2.ino
void feedWatchdog() {
  esp_task_wdt_reset();
}

// ================================ PREFERENCES ================================
void loadPreferences() {
  preferences.begin("victron", true);
  state.bootCount = preferences.getUInt("bootCount", 0) + 1;
  preferences.end();
  LOG_INFO("Boot count: %lu", state.bootCount);
}

void savePreferences() {
  preferences.begin("victron", false);
  preferences.putUInt("bootCount", state.bootCount);
  preferences.end();
}

// ================================ RUNTIME CONFIG DEFAULTS ================================
/**
 * @brief Populate RuntimeConfig from compiled #define values
 *
 * Called at boot before SD card is read. All config.h values become defaults.
 */
void initConfigDefaults() {
  memset(&cfg, 0, sizeof(cfg));

  // WiFi
  strncpy(cfg.wifiSsid, WIFI_SSID, sizeof(cfg.wifiSsid) - 1);
  strncpy(cfg.wifiPassword, WIFI_PASSWORD, sizeof(cfg.wifiPassword) - 1);
  cfg.wifiConnectTimeoutMs = WIFI_CONNECT_TIMEOUT_MS;
  cfg.wifiReconnectIntervalMs = WIFI_RECONNECT_INTERVAL_MS;

  // MQTT
  strncpy(cfg.mqttHost, MQTT_HOST, sizeof(cfg.mqttHost) - 1);
  cfg.mqttPort = MQTT_PORT;
  strncpy(cfg.mqttUser, MQTT_USER, sizeof(cfg.mqttUser) - 1);
  strncpy(cfg.mqttPassword, MQTT_PASSW, sizeof(cfg.mqttPassword) - 1);
  strncpy(cfg.mqttClientName, MQTT_CLIENT_NAME, sizeof(cfg.mqttClientName) - 1);
  strncpy(cfg.mqttBaseTopic, MQTT_BASE_TOPIC, sizeof(cfg.mqttBaseTopic) - 1);
  cfg.mqttQos = MQTT_QOS;
  cfg.mqttRetain = MQTT_RETAIN;

  // NTP
  strncpy(cfg.ntpServer, NTP_SERVER, sizeof(cfg.ntpServer) - 1);
  cfg.gmtOffsetSec = GMT_OFFSET_SEC;
  cfg.daylightOffsetSec = DAYLIGHT_OFFSET_SEC;

  // Device names
  strncpy(cfg.deviceNames[0], DEVICE_NAME_0, sizeof(cfg.deviceNames[0]) - 1);
  strncpy(cfg.deviceNames[1], DEVICE_NAME_1, sizeof(cfg.deviceNames[1]) - 1);
  strncpy(cfg.deviceNames[2], DEVICE_NAME_2, sizeof(cfg.deviceNames[2]) - 1);
  strncpy(cfg.deviceNames[3], DEVICE_NAME_3, sizeof(cfg.deviceNames[3]) - 1);

  // Device topics
  strncpy(cfg.deviceTopics[0], DEVICE_TOPIC_0, sizeof(cfg.deviceTopics[0]) - 1);
  strncpy(cfg.deviceTopics[1], DEVICE_TOPIC_1, sizeof(cfg.deviceTopics[1]) - 1);
  strncpy(cfg.deviceTopics[2], DEVICE_TOPIC_2, sizeof(cfg.deviceTopics[2]) - 1);
  strncpy(cfg.deviceTopics[3], DEVICE_TOPIC_3, sizeof(cfg.deviceTopics[3]) - 1);

  // Temperature thresholds
  cfg.tempFanOn[0] = TEMP_FAN_ON_MPPT_W;
  cfg.tempFanOn[1] = TEMP_FAN_ON_MPPT_E;
  cfg.tempFanOn[2] = TEMP_FAN_ON_MULTIPLUS;
  cfg.tempFanOn[3] = TEMP_FAN_ON_BATTERIES;
  cfg.tempFanOff[0] = TEMP_FAN_OFF_MPPT_W;
  cfg.tempFanOff[1] = TEMP_FAN_OFF_MPPT_E;
  cfg.tempFanOff[2] = TEMP_FAN_OFF_MULTIPLUS;
  cfg.tempFanOff[3] = TEMP_FAN_OFF_BATTERIES;
  cfg.tempFanHysteresis = TEMP_FAN_HYSTERESIS;
  cfg.tempMinValid = TEMP_MIN_VALID;
  cfg.tempMaxValid = TEMP_MAX_VALID;

  // Timing
  cfg.sensorInterval = SENSOR_INTERVAL;
  cfg.displayInterval = DISP_INTERVAL;
  cfg.mqttInterval = MQTT_INTERVAL;
  cfg.statusInterval = STATUS_INTERVAL;
  cfg.ntpInterval = NTP_INTERVAL;

  // Sensor addresses from config.h defaults
  const uint8_t defaultAddr0[] = SENSOR_ADDR_0;
  const uint8_t defaultAddr1[] = SENSOR_ADDR_1;
  const uint8_t defaultAddr2[] = SENSOR_ADDR_2;
  const uint8_t defaultAddr3[] = SENSOR_ADDR_3;
  memcpy(cfg.sensorAddresses[0], defaultAddr0, 8);
  memcpy(cfg.sensorAddresses[1], defaultAddr1, 8);
  memcpy(cfg.sensorAddresses[2], defaultAddr2, 8);
  memcpy(cfg.sensorAddresses[3], defaultAddr3, 8);

  // Display
  cfg.tftRotation = TFT_ROTATION;
  strncpy(cfg.startupLine1, STARTUP_LINE_1, sizeof(cfg.startupLine1) - 1);
  strncpy(cfg.startupLine2, STARTUP_LINE_2, sizeof(cfg.startupLine2) - 1);
  strncpy(cfg.startupLine3, STARTUP_LINE_3, sizeof(cfg.startupLine3) - 1);

  // Fan
  cfg.fanActiveLow = FAN_ACTIVE_LOW;

  // Watchdog
  cfg.wdtTimeoutS = WDT_TIMEOUT_S;

  // SD status
  cfg.sdCardPresent = false;
  cfg.configLoaded = false;

  LOG_INFO("Config defaults initialized from compiled values");
}

// ================================ MQTT TOPIC BUILDER ================================
/**
 * @brief Build all MQTT topic strings from cfg.mqttBaseTopic
 */
void buildMqttTopics() {
  snprintf(cfg.mqttPubStatus, sizeof(cfg.mqttPubStatus), "%s/monitor/status", cfg.mqttBaseTopic);
  snprintf(cfg.mqttPubWifiRssi, sizeof(cfg.mqttPubWifiRssi), "%s/monitor/rssi", cfg.mqttBaseTopic);
  snprintf(cfg.mqttPubWifiIp, sizeof(cfg.mqttPubWifiIp), "%s/monitor/ip", cfg.mqttBaseTopic);
  snprintf(cfg.mqttPubUptime, sizeof(cfg.mqttPubUptime), "%s/monitor/uptime", cfg.mqttBaseTopic);
  snprintf(cfg.mqttPubHeapFree, sizeof(cfg.mqttPubHeapFree), "%s/monitor/heap_free", cfg.mqttBaseTopic);
  snprintf(cfg.mqttPubVersion, sizeof(cfg.mqttPubVersion), "%s/monitor/version", cfg.mqttBaseTopic);
  snprintf(cfg.mqttPubAmbTemp, sizeof(cfg.mqttPubAmbTemp), "%s/ambient/temperature", cfg.mqttBaseTopic);
  snprintf(cfg.mqttPubAmbHum, sizeof(cfg.mqttPubAmbHum), "%s/ambient/humidity", cfg.mqttBaseTopic);
  LOG_INFO("MQTT topics built (base: %s)", cfg.mqttBaseTopic);
}

// ================================ SD CARD ================================
/**
 * @brief Initialize SD card on shared SPI bus
 * @return true if SD card detected and mounted
 */
bool initSDCard() {
  if (!SD.begin(SD_CS_PIN, SPI)) {
    cfg.sdCardPresent = false;
    LOG_WARN("SD card not found");
    return false;
  }
  cfg.sdCardPresent = true;
  LOG_INFO("SD card mounted (type: %d, size: %llu MB)", SD.cardType(), SD.cardSize() / (1024 * 1024));
  return true;
}

/**
 * @brief Check if SD card is still present (or newly inserted)
 *
 * Called periodically from loop(). Updates cfg.sdCardPresent.
 * If card was removed, ends SD. If card appears, re-initializes.
 */
void checkSDCard() {
  if (cfg.sdCardPresent) {
    // Card was present - check if still accessible
    if (SD.cardType() == CARD_NONE) {
      cfg.sdCardPresent = false;
      SD.end();
      LOG_WARN("SD card removed");
    }
  } else {
    // Card was absent - check if one was inserted
    if (SD.begin(SD_CS_PIN, SPI)) {
      if (SD.cardType() != CARD_NONE) {
        cfg.sdCardPresent = true;
        LOG_INFO("SD card inserted (type: %d, size: %llu MB)", SD.cardType(), SD.cardSize() / (1024 * 1024));
        if (SD.exists("/config.ini")) {
          promptLoadConfig();
        }
      } else {
        SD.end();
      }
    }
  }
}

/**
 * @brief Prompt user to load config.ini from newly inserted SD card
 *
 * Blocks for up to 10 seconds. Touch = load config, no touch = skip.
 * Called from checkSDCard() when a new card with config.ini is detected.
 */
void promptLoadConfig() {
  LOG_INFO("SD: config.ini found on new card - prompting user");

  // Show prompt screen
  tft.fillScreen(COLOR_BLACK);
  int16_t x1, y1;
  uint16_t w, h;

