RandMental/LTC---4-Zone-Temperature-Controller/ESP32_Victron_Dual_DS1820_MQTT_7735_v2/ESP32_Victron_Dual_DS1820_MQTT_7735_v2.ino
  tft.setFont(font_small);
  tft.setTextColor(COLOR_CYAN);
  const char* line1 = "SD Card";
  tft.getTextBounds(line1, 0, 0, &x1, &y1, &w, &h);
  tft.setCursor((TFT_WIDTH - w) / 2, 50);
  tft.print(line1);

  const char* line2 = "config.ini";
  tft.setTextColor(COLOR_WHITE);
  tft.getTextBounds(line2, 0, 0, &x1, &y1, &w, &h);
  tft.setCursor((TFT_WIDTH - w) / 2, 90);
  tft.print(line2);

  const char* line3 = "found";
  tft.getTextBounds(line3, 0, 0, &x1, &y1, &w, &h);
  tft.setCursor((TFT_WIDTH - w) / 2, 120);
  tft.print(line3);

  tft.setTextColor(COLOR_GREEN);
  const char* line4 = "Touch=Load";
  tft.getTextBounds(line4, 0, 0, &x1, &y1, &w, &h);
  tft.setCursor((TFT_WIDTH - w) / 2, 180);
  tft.print(line4);

  // Countdown loop - 10 seconds
  unsigned long startTime = millis();
  bool accepted = false;
  int lastSec = -1;

  while ((millis() - startTime) < 10000) {
    feedWatchdog();

    int remaining = 10 - (int)((millis() - startTime) / 1000);
    if (remaining != lastSec) {
      lastSec = remaining;
      // Clear countdown area and redraw
      tft.fillRect(0, 230, TFT_WIDTH, 40, COLOR_BLACK);
      tft.setFont(font_small);
      tft.setTextColor(COLOR_YELLOW);
      char countStr[16];
      snprintf(countStr, sizeof(countStr), "Skip in %ds", remaining);
      tft.getTextBounds(countStr, 0, 0, &x1, &y1, &w, &h);
      tft.setCursor((TFT_WIDTH - w) / 2, 260);
      tft.print(countStr);
    }

    if (isInputActive()) {
      accepted = true;
      break;
    }

    delay(50);
  }

  if (accepted) {
    // Show loading message
    tft.fillScreen(COLOR_BLACK);
    tft.setFont(font_small);
    tft.setTextColor(COLOR_GREEN);
    const char* loading = "Loading...";
    tft.getTextBounds(loading, 0, 0, &x1, &y1, &w, &h);
    tft.setCursor((TFT_WIDTH - w) / 2, 160);
    tft.print(loading);

    loadConfigFromSD();
    buildMqttTopics();
    fanOnState = cfg.fanActiveLow ? LOW : HIGH;
    fanOffState = cfg.fanActiveLow ? HIGH : LOW;

    LOG_INFO("SD: config loaded from new card");
    delay(1000);
  } else {
    LOG_INFO("SD: user skipped config load");
  }

  // Restore normal display
  tft.fillScreen(COLOR_BLACK);
  displayCache.init();
}

/**
 * @brief Parse colon-separated hex address string into 8-byte array
 * @param str Address string like "28:D6:0D:95:F0:01:3C:B0"
 * @param addr Output 8-byte array
 * @return true if parsed successfully
 */
bool parseSensorAddress(const char* str, uint8_t* addr) {
  int values[8];
  int count = sscanf(str, "%x:%x:%x:%x:%x:%x:%x:%x",
                     &values[0], &values[1], &values[2], &values[3],
                     &values[4], &values[5], &values[6], &values[7]);
  if (count != 8) return false;
  for (int i = 0; i < 8; i++) {
    addr[i] = (uint8_t)values[i];
  }
  return true;
}

/**
 * @brief Apply a single key=value pair to RuntimeConfig
 * @param key INI key name (trimmed)
 * @param value INI value (trimmed)
 */
void applyConfigKey(const char* key, const char* value) {
  // WiFi
  if (strcmp(key, "wifi_ssid") == 0) {
    strncpy(cfg.wifiSsid, value, sizeof(cfg.wifiSsid) - 1);
    return;
  }
  if (strcmp(key, "wifi_password") == 0) {
    strncpy(cfg.wifiPassword, value, sizeof(cfg.wifiPassword) - 1);
    return;
  }
  if (strcmp(key, "wifi_connect_timeout_ms") == 0) {
    cfg.wifiConnectTimeoutMs = atol(value);
    return;
  }
  if (strcmp(key, "wifi_reconnect_interval_ms") == 0) {
    cfg.wifiReconnectIntervalMs = atol(value);
    return;
  }

  // MQTT
  if (strcmp(key, "mqtt_host") == 0) {
    strncpy(cfg.mqttHost, value, sizeof(cfg.mqttHost) - 1);
    return;
  }
  if (strcmp(key, "mqtt_port") == 0) {
    cfg.mqttPort = atoi(value);
    return;
  }
  if (strcmp(key, "mqtt_user") == 0) {
    strncpy(cfg.mqttUser, value, sizeof(cfg.mqttUser) - 1);
    return;
  }
  if (strcmp(key, "mqtt_password") == 0) {
    strncpy(cfg.mqttPassword, value, sizeof(cfg.mqttPassword) - 1);
    return;
  }
  if (strcmp(key, "mqtt_client_name") == 0) {
    strncpy(cfg.mqttClientName, value, sizeof(cfg.mqttClientName) - 1);
    return;
  }
  if (strcmp(key, "mqtt_base_topic") == 0) {
    strncpy(cfg.mqttBaseTopic, value, sizeof(cfg.mqttBaseTopic) - 1);
    return;
  }
  if (strcmp(key, "mqtt_qos") == 0) {
    cfg.mqttQos = atoi(value);
    return;
  }
  if (strcmp(key, "mqtt_retain") == 0) {
    cfg.mqttRetain = (strcmp(value, "true") == 0 || strcmp(value, "1") == 0);
    return;
  }

  // NTP
  if (strcmp(key, "ntp_server") == 0) {
    strncpy(cfg.ntpServer, value, sizeof(cfg.ntpServer) - 1);
    return;
  }
  if (strcmp(key, "gmt_offset_sec") == 0) {
    cfg.gmtOffsetSec = atol(value);
    return;
  }
  if (strcmp(key, "daylight_offset_sec") == 0) {
    cfg.daylightOffsetSec = atoi(value);
    return;
  }

  // Device names
  if (strcmp(key, "device_name_0") == 0) {
    strncpy(cfg.deviceNames[0], value, sizeof(cfg.deviceNames[0]) - 1);
    return;
  }
  if (strcmp(key, "device_name_1") == 0) {
    strncpy(cfg.deviceNames[1], value, sizeof(cfg.deviceNames[1]) - 1);
    return;
  }
  if (strcmp(key, "device_name_2") == 0) {
    strncpy(cfg.deviceNames[2], value, sizeof(cfg.deviceNames[2]) - 1);
    return;
  }
  if (strcmp(key, "device_name_3") == 0) {
    strncpy(cfg.deviceNames[3], value, sizeof(cfg.deviceNames[3]) - 1);
    return;
  }

  // Device topics
  if (strcmp(key, "device_topic_0") == 0) {
    strncpy(cfg.deviceTopics[0], value, sizeof(cfg.deviceTopics[0]) - 1);
    return;
  }
  if (strcmp(key, "device_topic_1") == 0) {
    strncpy(cfg.deviceTopics[1], value, sizeof(cfg.deviceTopics[1]) - 1);
    return;
  }
  if (strcmp(key, "device_topic_2") == 0) {
    strncpy(cfg.deviceTopics[2], value, sizeof(cfg.deviceTopics[2]) - 1);
    return;
  }
  if (strcmp(key, "device_topic_3") == 0) {
    strncpy(cfg.deviceTopics[3], value, sizeof(cfg.deviceTopics[3]) - 1);
    return;
  }

  // Temperature thresholds
  if (strcmp(key, "temp_fan_on_0") == 0) {
    cfg.tempFanOn[0] = atof(value);
    return;
  }
  if (strcmp(key, "temp_fan_on_1") == 0) {
    cfg.tempFanOn[1] = atof(value);
    return;
  }
  if (strcmp(key, "temp_fan_on_2") == 0) {
    cfg.tempFanOn[2] = atof(value);
    return;
  }
  if (strcmp(key, "temp_fan_on_3") == 0) {
    cfg.tempFanOn[3] = atof(value);
    return;
  }
  if (strcmp(key, "temp_fan_off_0") == 0) {
    cfg.tempFanOff[0] = atof(value);
    return;
  }
  if (strcmp(key, "temp_fan_off_1") == 0) {
    cfg.tempFanOff[1] = atof(value);
    return;
  }
  if (strcmp(key, "temp_fan_off_2") == 0) {
    cfg.tempFanOff[2] = atof(value);
    return;
  }
  if (strcmp(key, "temp_fan_off_3") == 0) {
    cfg.tempFanOff[3] = atof(value);
    return;
  }
  if (strcmp(key, "temp_fan_hysteresis") == 0) {
    cfg.tempFanHysteresis = atof(value);
    return;
  }
  if (strcmp(key, "temp_min_valid") == 0) {
    cfg.tempMinValid = atof(value);
    return;
  }
  if (strcmp(key, "temp_max_valid") == 0) {
    cfg.tempMaxValid = atof(value);
    return;
  }

