RandMental/LTC---4-Zone-Temperature-Controller/ESP32_Victron_Dual_DS1820_MQTT_7735_v2/ESP32_Victron_Dual_DS1820_MQTT_7735_v2.ino
  // Timing
  if (strcmp(key, "sensor_interval") == 0) {
    cfg.sensorInterval = atol(value);
    return;
  }
  if (strcmp(key, "display_interval") == 0) {
    cfg.displayInterval = atol(value);
    return;
  }
  if (strcmp(key, "mqtt_interval") == 0) {
    cfg.mqttInterval = atol(value);
    return;
  }
  if (strcmp(key, "status_interval") == 0) {
    cfg.statusInterval = atol(value);
    return;
  }
  if (strcmp(key, "ntp_interval") == 0) {
    cfg.ntpInterval = atol(value);
    return;
  }

  // Sensor addresses
  if (strcmp(key, "sensor_addr_0") == 0) {
    parseSensorAddress(value, cfg.sensorAddresses[0]);
    return;
  }
  if (strcmp(key, "sensor_addr_1") == 0) {
    parseSensorAddress(value, cfg.sensorAddresses[1]);
    return;
  }
  if (strcmp(key, "sensor_addr_2") == 0) {
    parseSensorAddress(value, cfg.sensorAddresses[2]);
    return;
  }
  if (strcmp(key, "sensor_addr_3") == 0) {
    parseSensorAddress(value, cfg.sensorAddresses[3]);
    return;
  }

  // Display
  if (strcmp(key, "tft_rotation") == 0) {
    cfg.tftRotation = atoi(value);
    return;
  }
  if (strcmp(key, "startup_line_1") == 0) {
    strncpy(cfg.startupLine1, value, sizeof(cfg.startupLine1) - 1);
    return;
  }
  if (strcmp(key, "startup_line_2") == 0) {
    strncpy(cfg.startupLine2, value, sizeof(cfg.startupLine2) - 1);
    return;
  }
  if (strcmp(key, "startup_line_3") == 0) {
    strncpy(cfg.startupLine3, value, sizeof(cfg.startupLine3) - 1);
    return;
  }

  // Fan
  if (strcmp(key, "fan_active_low") == 0) {
    cfg.fanActiveLow = (strcmp(value, "true") == 0 || strcmp(value, "1") == 0);
    return;
  }

  // Watchdog
  if (strcmp(key, "wdt_timeout_s") == 0) {
    cfg.wdtTimeoutS = atol(value);
    return;
  }

  LOG_WARN("Unknown config key: %s", key);
}

/**
 * @brief Load configuration from /config.ini on SD card
 * @return true if file was found and parsed
 */
bool loadConfigFromSD() {
  if (!cfg.sdCardPresent) return false;

  File file = SD.open("/config.ini", FILE_READ);
  if (!file) {
    LOG_INFO("SD: no config.ini found - creating template");
    writeConfigToSD();
    return false;
  }

  char line[128];
  int keyCount = 0;

  while (file.available()) {
    // Read line
    int len = 0;
    while (file.available() && len < (int)sizeof(line) - 1) {
      char c = file.read();
      if (c == '\n') break;
      if (c == '\r') continue;
      line[len++] = c;
    }
    line[len] = '\0';

    // Skip empty lines and comments
    if (len == 0 || line[0] == ';' || line[0] == '#') continue;

    // Find '=' separator
    char* eq = strchr(line, '=');
    if (!eq) continue;

    // Split into key and value
    *eq = '\0';
    char* key = line;
    char* value = eq + 1;

    // Trim leading/trailing whitespace from key
    while (*key == ' ' || *key == '\t') key++;
    char* keyEnd = eq - 1;
    while (keyEnd > key && (*keyEnd == ' ' || *keyEnd == '\t')) *keyEnd-- = '\0';

    // Trim leading/trailing whitespace from value
    while (*value == ' ' || *value == '\t') value++;
    char* valueEnd = value + strlen(value) - 1;
    while (valueEnd > value && (*valueEnd == ' ' || *valueEnd == '\t')) *valueEnd-- = '\0';

    if (strlen(key) > 0 && strlen(value) > 0) {
      applyConfigKey(key, value);
      keyCount++;
    }
  }

  file.close();
  cfg.configLoaded = true;
  LOG_INFO("SD: loaded %d config keys from /config.ini", keyCount);
  return true;
}

/**
 * @brief Write current runtime config to /config.ini on SD card
 * @return true if file was written successfully
 */
bool writeConfigToSD() {
  if (!cfg.sdCardPresent) {
    LOG_WARN("SD: cannot write config - no SD card");
    return false;
  }

  File file = SD.open("/config.ini", FILE_WRITE);
  if (!file) {
    LOG_ERROR("SD: failed to open /config.ini for writing");
    return false;
  }

  file.println("; =============================================================================");
  file.println("; config.ini - Runtime configuration for Victron Temperature Monitor");
  file.printf("; Generated by firmware v%s on boot\n", FIRMWARE_VERSION);
  file.println("; Only uncomment keys you want to override. Delete ; at start of line.");
  file.println("; =============================================================================");

  file.println();
  file.println("; ================================ WiFi ================================");
  file.printf("; wifi_ssid = %s\n", cfg.wifiSsid);
  file.printf("; wifi_password = %s\n", cfg.wifiPassword);
  file.printf("; wifi_connect_timeout_ms = %lu\n", cfg.wifiConnectTimeoutMs);
  file.printf("; wifi_reconnect_interval_ms = %lu\n", cfg.wifiReconnectIntervalMs);

  file.println();
  file.println("; ================================ MQTT ================================");
  file.printf("; mqtt_host = %s\n", cfg.mqttHost);
  file.printf("; mqtt_port = %d\n", cfg.mqttPort);
  file.printf("; mqtt_user = %s\n", cfg.mqttUser);
  file.printf("; mqtt_password = %s\n", cfg.mqttPassword);
  file.printf("; mqtt_client_name = %s\n", cfg.mqttClientName);
  file.printf("; mqtt_base_topic = %s\n", cfg.mqttBaseTopic);
  file.printf("; mqtt_qos = %d\n", cfg.mqttQos);
  file.printf("; mqtt_retain = %s\n", cfg.mqttRetain ? "true" : "false");

  file.println();
  file.println("; ================================ NTP ================================");
  file.printf("; ntp_server = %s\n", cfg.ntpServer);
  file.printf("; gmt_offset_sec = %ld\n", cfg.gmtOffsetSec);
  file.printf("; daylight_offset_sec = %d\n", cfg.daylightOffsetSec);

  file.println();
  file.println("; ================================ Device Names ================================");
  for (int i = 0; i < NUM_TEMP_SENSORS; i++) {
    file.printf("; device_name_%d = %s\n", i, cfg.deviceNames[i]);
  }

  file.println();
  file.println("; ================================ MQTT Topic Suffixes ================================");
  for (int i = 0; i < NUM_TEMP_SENSORS; i++) {
    file.printf("; device_topic_%d = %s\n", i, cfg.deviceTopics[i]);
  }

  file.println();
  file.println("; ================================ Temperature Thresholds ================================");
  for (int i = 0; i < NUM_TEMP_SENSORS; i++) {
    file.printf("; temp_fan_on_%d = %.1f\n", i, cfg.tempFanOn[i]);
  }
  for (int i = 0; i < NUM_TEMP_SENSORS; i++) {
    file.printf("; temp_fan_off_%d = %.1f\n", i, cfg.tempFanOff[i]);
  }
  file.printf("; temp_fan_hysteresis = %.1f\n", cfg.tempFanHysteresis);
  file.printf("; temp_min_valid = %.1f\n", cfg.tempMinValid);
  file.printf("; temp_max_valid = %.1f\n", cfg.tempMaxValid);

