RandMental/LTC---4-Zone-Temperature-Controller/ESP32_Victron_Dual_DS1820_MQTT_7735_v2/ESP32_Victron_Dual_DS1820_MQTT_7735_v2.ino
  file.println();
  file.println("; ================================ Timing Intervals (ms) ================================");
  file.printf("; sensor_interval = %lu\n", cfg.sensorInterval);
  file.printf("; display_interval = %lu\n", cfg.displayInterval);
  file.printf("; mqtt_interval = %lu\n", cfg.mqttInterval);
  file.printf("; status_interval = %lu\n", cfg.statusInterval);
  file.printf("; ntp_interval = %lu\n", cfg.ntpInterval);

  file.println();
  file.println("; ================================ Sensor Addresses ================================");
  file.println("; Format: colon-separated hex (28:XX:XX:XX:XX:XX:XX:XX)");
  file.println("; NVS-saved addresses from assignment mode take priority over these.");
  for (int i = 0; i < NUM_TEMP_SENSORS; i++) {
    file.printf("; sensor_addr_%d = %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X\n", i,
                cfg.sensorAddresses[i][0], cfg.sensorAddresses[i][1],
                cfg.sensorAddresses[i][2], cfg.sensorAddresses[i][3],
                cfg.sensorAddresses[i][4], cfg.sensorAddresses[i][5],
                cfg.sensorAddresses[i][6], cfg.sensorAddresses[i][7]);
  }

  file.println();
  file.println("; ================================ Display ================================");
  file.printf("; tft_rotation = %d\n", cfg.tftRotation);
  file.printf("; startup_line_1 = %s\n", cfg.startupLine1);
  file.printf("; startup_line_2 = %s\n", cfg.startupLine2);
  file.printf("; startup_line_3 = %s\n", cfg.startupLine3);

  file.println();
  file.println("; ================================ Fan Relay ================================");
  file.printf("; fan_active_low = %s\n", cfg.fanActiveLow ? "true" : "false");

  file.println();
  file.println("; ================================ Watchdog ================================");
  file.printf("; wdt_timeout_s = %lu\n", cfg.wdtTimeoutS);

  file.close();
  LOG_INFO("SD: config.ini written with current values");
  return true;
}

/**
 * @brief Display startup screen with SD card status
 *
 * Split from initDisplay() - shows title, version, sensor count, SD status.
 */
void displayStartupScreen() {
  int16_t x1, y1;
  uint16_t w, h;
  char info[20];

  tft.fillScreen(COLOR_BLACK);
  tft.setTextSize(1);

  // Title lines (from runtime config)
  tft.setTextColor(COLOR_WHITE);
  tft.setFont(font_small);

  tft.getTextBounds(cfg.startupLine1, 0, 0, &x1, &y1, &w, &h);
  tft.setCursor((TFT_WIDTH - w) / 2, 50);
  tft.print(cfg.startupLine1);

  tft.getTextBounds(cfg.startupLine2, 0, 0, &x1, &y1, &w, &h);
  tft.setCursor((TFT_WIDTH - w) / 2, 80);
  tft.print(cfg.startupLine2);

  tft.getTextBounds(cfg.startupLine3, 0, 0, &x1, &y1, &w, &h);
  tft.setCursor((TFT_WIDTH - w) / 2, 110);
  tft.print(cfg.startupLine3);

  // Version
  tft.setTextColor(COLOR_CYAN);
  snprintf(info, sizeof(info), "V%s", FIRMWARE_VERSION);
  tft.getTextBounds(info, 0, 0, &x1, &y1, &w, &h);
  tft.setCursor((TFT_WIDTH - w) / 2, 160);
  tft.print(info);

  // Sensors and Fans
  tft.setTextColor(COLOR_YELLOW);
  snprintf(info, sizeof(info), "%d Sensors", NUM_TEMP_SENSORS);
  tft.getTextBounds(info, 0, 0, &x1, &y1, &w, &h);
  tft.setCursor((TFT_WIDTH - w) / 2, 200);
  tft.print(info);

  snprintf(info, sizeof(info), "%d Fans", NUM_FANS);
  tft.getTextBounds(info, 0, 0, &x1, &y1, &w, &h);
  tft.setCursor((TFT_WIDTH - w) / 2, 230);
  tft.print(info);

  // SD card status
  tft.setFont(NULL);
  tft.setTextSize(2);
  if (cfg.sdCardPresent && cfg.configLoaded) {
    tft.setTextColor(COLOR_GREEN);
    const char* sdMsg = "SD: config loaded";
    tft.getTextBounds(sdMsg, 0, 0, &x1, &y1, &w, &h);
    tft.setCursor((TFT_WIDTH - w) / 2, 280);
    tft.print(sdMsg);
  } else if (cfg.sdCardPresent) {
    tft.setTextColor(COLOR_YELLOW);
    const char* sdMsg = "SD: no config.ini";
    tft.getTextBounds(sdMsg, 0, 0, &x1, &y1, &w, &h);
    tft.setCursor((TFT_WIDTH - w) / 2, 280);
    tft.print(sdMsg);
  } else {
    tft.setTextColor(COLOR_ORANGE);
    const char* sdMsg = "SD: not found";
    tft.getTextBounds(sdMsg, 0, 0, &x1, &y1, &w, &h);
    tft.setCursor((TFT_WIDTH - w) / 2, 280);
    tft.print(sdMsg);
  }
}

/**
 * @brief Display a two-line OTA/upload status message centered on TFT
 * @param line1 First line text (e.g. "Uploading")
 * @param line2 Second line text (e.g. "Firmware...")
 * @param color Text color for both lines
 */
void displayOtaStatus(const char* line1, const char* line2, uint16_t color) {
  int16_t x1, y1;
  uint16_t w, h;

  tft.fillScreen(COLOR_BLACK);
  tft.setTextSize(1);
  tft.setFont(font_small);
  tft.setTextColor(color);

  tft.getTextBounds(line1, 0, 0, &x1, &y1, &w, &h);
  tft.setCursor((TFT_WIDTH - w) / 2, 140);
  tft.print(line1);

  tft.getTextBounds(line2, 0, 0, &x1, &y1, &w, &h);
  tft.setCursor((TFT_WIDTH - w) / 2, 180);
  tft.print(line2);
}

// ================================ HEAP MONITORING ================================
void updateHeapStats() {
  uint32_t freeHeap = ESP.getFreeHeap();
  if (freeHeap < state.minHeap) {
    state.minHeap = freeHeap;
  }

  // Warn if heap is getting low
  if (freeHeap < 20000) {
    LOG_WARN("Low heap: %lu bytes", freeHeap);
  }
}

// ================================ SENSOR ADDRESS VALIDATION ================================
bool isSensorAddressValid(uint8_t index) {
  if (index >= NUM_TEMP_SENSORS) return false;

  // Check for valid DS18B20 address (0x28 family, not placeholder, valid CRC)
  if (sensorAddresses[index][0] != 0x28) return false;
  if (sensorAddresses[index][1] == 0x00 && sensorAddresses[index][2] == 0x00) return false;
  // Skip CRC check here as it's done during loading
  return true;
}

// ================================ SENSOR ADDRESS PERSISTENCE ================================
// Default addresses from config.h (used as fallback if NVS is empty/invalid)
const DeviceAddress defaultSensorAddresses[NUM_TEMP_SENSORS] = {
  SENSOR_ADDR_0,
  SENSOR_ADDR_1,
  SENSOR_ADDR_2,
  SENSOR_ADDR_3
};

// Check if an address is valid (starts with 0x28 and not a placeholder)
bool isAddressValidDS18B20(const uint8_t* addr) {
  // Must start with 0x28 (DS18B20 family code)
  if (addr[0] != 0x28) return false;
  // Check it's not a placeholder (0x28,0x00,0x00,...)
  if (addr[1] == 0x00 && addr[2] == 0x00) return false;
  return true;
}

