RandMental/LTC---4-Zone-Temperature-Controller/ESP32_Victron_Dual_DS1820_MQTT_7735_v2/ESP32_Victron_Dual_DS1820_MQTT_7735_v2.ino
void loadSensorAddresses() {
  // Three-tier fallback: NVS (from prior assignment) > SD card config > compiled defaults
  preferences.begin("victron", true);

  for (int i = 0; i < NUM_TEMP_SENSORS; i++) {
    char key[12];
    snprintf(key, sizeof(key), "sensor%d", i);

    uint8_t nvsAddr[8] = { 0 };
    size_t len = preferences.getBytes(key, nvsAddr, 8);

    if ((len == 8) && isAddressValidDS18B20(nvsAddr)) {
      // Priority 1: NVS (from sensor assignment mode)
      memcpy(sensorAddresses[i], nvsAddr, 8);
      LOG_INFO("Sensor %d: loaded from NVS: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X",
               i, nvsAddr[0], nvsAddr[1], nvsAddr[2], nvsAddr[3],
               nvsAddr[4], nvsAddr[5], nvsAddr[6], nvsAddr[7]);
    } else if (isAddressValidDS18B20(cfg.sensorAddresses[i])) {
      // Priority 2: SD card config (or compiled default if no SD)
      memcpy(sensorAddresses[i], cfg.sensorAddresses[i], 8);
      LOG_INFO("Sensor %d: using %s: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X",
               i, cfg.configLoaded ? "SD card" : "compiled default",
               cfg.sensorAddresses[i][0], cfg.sensorAddresses[i][1],
               cfg.sensorAddresses[i][2], cfg.sensorAddresses[i][3],
               cfg.sensorAddresses[i][4], cfg.sensorAddresses[i][5],
               cfg.sensorAddresses[i][6], cfg.sensorAddresses[i][7]);
    } else {
      // Priority 3: compiled default (placeholder)
      memcpy(sensorAddresses[i], defaultSensorAddresses[i], 8);
      LOG_INFO("Sensor %d: placeholder (not configured)", i);
    }
  }
  preferences.end();
  LOG_INFO("Sensor addresses loaded");
}

void saveSensorAddresses() {
  // Save to NVS for persistence across reboots
  preferences.begin("victron", false);
  for (int i = 0; i < NUM_TEMP_SENSORS; i++) {
    char key[12];
    snprintf(key, sizeof(key), "sensor%d", i);
    preferences.putBytes(key, sensorAddresses[i], 8);
  }
  preferences.end();
  LOG_INFO("Sensor addresses saved to NVS");

  // Also print addresses in config.h format for user to copy
  Serial.println("\n========================================");
  Serial.println("  SENSOR ADDRESSES - Copy to config.h");
  Serial.println("========================================");
  for (int i = 0; i < NUM_TEMP_SENSORS; i++) {
    Serial.printf("#define SENSOR_ADDR_%d  { 0x%02X, 0x%02X, 0x%02X, 0x%02X, 0x%02X, 0x%02X, 0x%02X, 0x%02X }  // %s\n",
                  i,
                  sensorAddresses[i][0], sensorAddresses[i][1],
                  sensorAddresses[i][2], sensorAddresses[i][3],
                  sensorAddresses[i][4], sensorAddresses[i][5],
                  sensorAddresses[i][6], sensorAddresses[i][7],
                  cfg.deviceNames[i]);
  }
  Serial.println("========================================\n");
}

bool hasStoredSensorAddresses() {
  for (int i = 0; i < NUM_TEMP_SENSORS; i++) {
    if (isSensorAddressValid(i)) return true;
  }
  return false;
}

// ================================ TOUCHSCREEN ================================
void initTouch() {
  touch.begin();
  touch.setRotation(cfg.tftRotation);
  LOG_INFO("Touchscreen initialized (XPT2046, CS=GPIO%d, IRQ=GPIO%d)", TCH_CS, TCH_IRQ);
}

// Returns true if screen is touched
bool isInputActive() {
  return touch.touched();
}

// Returns: 0=no press, 1=short press (<1s), 2=medium press (1-5s), 3=long press (>5s)
uint8_t checkButton() {
  bool isPressed = isInputActive();
  uint32_t now = millis();

  if (isPressed && !state.buttonPressed) {
    // Button just pressed
    state.buttonPressed = true;
    state.buttonPressStartTime = now;
    LOG_DEBUG("Button pressed");
    return 0;
  }

  if (!isPressed && state.buttonPressed) {
    // Button released
    state.buttonPressed = false;
    uint32_t duration = now - state.buttonPressStartTime;

    // Ignore bounces/noise under 100ms
    if (duration < BUTTON_DEBOUNCE_MS) {
      return 0;
    }

    if (duration >= LONG_PRESS_MS) {
      LOG_INFO("Long press detected (%lu ms)", duration);
      return 3;  // Enter assignment mode
    } else if (duration >= SKIP_PRESS_MIN_MS) {
      LOG_INFO("Medium press detected (%lu ms)", duration);
      return 2;  // Skip sensor (1-5s)
    } else {
      LOG_INFO("Short press detected (%lu ms)", duration);
      return 1;  // Test fans (<1s)
    }
  }

  return 0;
}

// ================================ RGB LED (RAINBOW PULSE) ================================
// Rainbow colors: Red, Orange, Yellow, Green, Cyan, Blue, Violet
const uint8_t RAINBOW_COLORS[][3] = {
  { 255, 0, 0 },    // Red
  { 255, 127, 0 },  // Orange
  { 255, 255, 0 },  // Yellow
  { 0, 255, 0 },    // Green
  { 0, 255, 255 },  // Cyan
  { 0, 0, 255 },    // Blue
  { 148, 0, 211 }   // Violet
};
const uint8_t NUM_RAINBOW_COLORS = sizeof(RAINBOW_COLORS) / sizeof(RAINBOW_COLORS[0]);

void initRgbLed() {
  pinMode(RGB_LED_PIN, OUTPUT);
  neopixelWrite(RGB_LED_PIN, 0, 0, 0);  // Start with LED off
  LOG_INFO("RGB LED initialized on GPIO%d", RGB_LED_PIN);
}

void updateRgbLed() {
  uint32_t now = millis();
  uint32_t elapsed = now - state.lastRgbPulse;

  // Every 1 second, pulse the next rainbow color
  if (elapsed >= 1000) {
    // Scale color by brightness
    uint8_t r = (RAINBOW_COLORS[state.rgbColorIndex][0] * RGB_BRIGHTNESS) / 255;
    uint8_t g = (RAINBOW_COLORS[state.rgbColorIndex][1] * RGB_BRIGHTNESS) / 255;
    uint8_t b = (RAINBOW_COLORS[state.rgbColorIndex][2] * RGB_BRIGHTNESS) / 255;

    // Turn LED on with current rainbow color
    neopixelWrite(RGB_LED_PIN, r, g, b);

    // Advance to next color
    state.rgbColorIndex = (state.rgbColorIndex + 1) % NUM_RAINBOW_COLORS;
    state.lastRgbPulse = now;
  }
  // Turn LED off after pulse duration
  else if (elapsed >= RGB_PULSE_MS && elapsed < 1000) {
    neopixelWrite(RGB_LED_PIN, 0, 0, 0);
  }
}

// ================================ TEST FANS MODE ================================
#define TEST_FAN_ON_MS 5000     // Each fan ON for 5 seconds
#define TEST_FAN_PAUSE_MS 1000  // Pause between fans

void enterTestFansMode() {
  state.operatingMode = MODE_TEST_FANS;
  state.testFansStartTime = millis();
  state.currentTestFan = 0;
  state.testFanPhase = true;  // Start with fan ON phase

  // Clear screen
  tft.fillScreen(COLOR_BLACK);

  // Ensure all fans OFF first
  for (int i = 0; i < NUM_FANS; i++) {
    digitalWrite(FAN_RELAY_PINS[i], fanOffState);
    state.fanStates[i] = false;
  }

  // Turn on first fan
  digitalWrite(FAN_RELAY_PINS[0], fanOnState);
  state.fanStates[0] = true;

  LOG_INFO("Test Fans mode: starting with Fan 1");
  displayTestFansScreen();
}

