RandMental/LTC---4-Zone-Temperature-Controller/ESP32_Victron_Dual_DS1820_MQTT_7735_v2/ESP32_Victron_Dual_DS1820_MQTT_7735_v2.ino
void handleTestFansMode() {
  uint32_t elapsed = millis() - state.testFansStartTime;

  if (state.testFanPhase) {
    // Fan ON phase - wait for 5 seconds
    if (elapsed >= TEST_FAN_ON_MS) {
      // Turn current fan OFF
      digitalWrite(FAN_RELAY_PINS[state.currentTestFan], fanOffState);
      state.fanStates[state.currentTestFan] = false;
      LOG_INFO("Fan %d OFF", state.currentTestFan + 1);

      // Check if this was the last fan
      if (state.currentTestFan >= NUM_FANS - 1) {
        // All fans tested - exit test mode
        LOG_INFO("Test Fans complete");

        // Clear screen and invalidate display cache for clean redraw
        tft.fillScreen(COLOR_BLACK);
        displayCache.init();

        state.operatingMode = MODE_NORMAL;
        return;
      }

      // Move to pause phase
      state.testFanPhase = false;
      state.testFansStartTime = millis();
      displayTestFansScreen();  // Update display to show pause
    }
  } else {
    // Pause phase - wait for 1 second
    if (elapsed >= TEST_FAN_PAUSE_MS) {
      // Move to next fan
      state.currentTestFan++;
      state.testFanPhase = true;
      state.testFansStartTime = millis();

      // Turn on next fan
      digitalWrite(FAN_RELAY_PINS[state.currentTestFan], fanOnState);
      state.fanStates[state.currentTestFan] = true;
      LOG_INFO("Fan %d ON", state.currentTestFan + 1);
      displayTestFansScreen();  // Update display
    }
  }
}

void displayTestFansScreen() {
  tft.setFont(NULL);
  tft.setTextSize(2);
  tft.setTextColor(COLOR_YELLOW);

  // Clear content area below status bar
  tft.fillRect(0, STATUSBAR_HEIGHT, TFT_WIDTH, TFT_HEIGHT - STATUSBAR_HEIGHT, COLOR_BLACK);

  int16_t x1, y1;
  uint16_t w, h;

  // Title - centered
  tft.getTextBounds("FAN TEST", 0, 0, &x1, &y1, &w, &h);
  tft.setCursor((TFT_WIDTH - w) / 2, TITLE_Y);
  tft.print("FAN TEST");

  // Horizontal line under title
  tft.drawFastHLine(20, TITLE_LINE_Y, TFT_WIDTH - 40, COLOR_YELLOW);

  // Progress indicator [1/4]
  char progress[8];
  snprintf(progress, sizeof(progress), "[%d/%d]", state.currentTestFan + 1, NUM_FANS);
  tft.getTextBounds(progress, 0, 0, &x1, &y1, &w, &h);
  tft.setCursor((TFT_WIDTH - w) / 2, PROGRESS_Y);
  tft.print(progress);

  // Fan name - centered, larger
  tft.setTextSize(3);
  const char* fanName = cfg.deviceNames[state.currentTestFan];
  tft.getTextBounds(fanName, 0, 0, &x1, &y1, &w, &h);
  tft.setCursor((TFT_WIDTH - w) / 2, MODE_NAME_Y);
  tft.print(fanName);

  // Status - ON or PAUSE
  tft.setTextSize(3);
  if (state.testFanPhase) {
    tft.setTextColor(COLOR_GREEN);
    tft.getTextBounds("ON", 0, 0, &x1, &y1, &w, &h);
    tft.setCursor((TFT_WIDTH - w) / 2, STATUS_Y);
    tft.print("ON");
  } else {
    tft.setTextColor(COLOR_YELLOW);
    tft.getTextBounds("PAUSE", 0, 0, &x1, &y1, &w, &h);
    tft.setCursor((TFT_WIDTH - w) / 2, STATUS_Y);
    tft.print("PAUSE");
  }

  // Visual fan indicators at bottom
  tft.setTextSize(2);
  tft.setTextColor(COLOR_YELLOW);
  int startX = (TFT_WIDTH - (NUM_FANS * BOX_SPACING)) / 2;
  for (int i = 0; i < NUM_FANS; i++) {
    int x = startX + (i * BOX_SPACING);
    if (i == state.currentTestFan && state.testFanPhase) {
      // Current fan ON - filled box
      tft.fillRect(x, BOX_Y, BOX_SIZE, BOX_SIZE, COLOR_YELLOW);
      tft.setTextColor(COLOR_BLACK);
      tft.setCursor(x + 14, BOX_Y + 12);
      tft.print(i + 1);
      tft.setTextColor(COLOR_YELLOW);
    } else if (i < state.currentTestFan) {
      // Already tested - outline with check
      tft.drawRect(x, BOX_Y, BOX_SIZE, BOX_SIZE, COLOR_YELLOW);
      tft.setCursor(x + 8, BOX_Y + 12);
      tft.print("OK");
    } else {
      // Not yet tested - outline only
      tft.drawRect(x, BOX_Y, BOX_SIZE, BOX_SIZE, COLOR_YELLOW);
      tft.setCursor(x + 14, BOX_Y + 12);
      tft.print(i + 1);
    }
  }
}

// ================================ SENSOR ASSIGNMENT MODE ================================
void resetStepState() {
  state.sensorDetectedForStep = false;
  memset(state.detectedAddress, 0, sizeof(state.detectedAddress));
  state.detectedTemperature = 0.0f;
  state.confirmButtonWasPressed = false;
  state.confirmButtonPressStart = 0;
  state.confirmButtonReleaseTime = 0;
  state.awaitingConfirmRelease = false;
  state.awaitingSensorRemoval = false;
}

void enterSensorAssignmentMode() {
  state.operatingMode = MODE_SENSOR_CLEAR_BUS;
  state.currentSensorIndex = 0;
  state.assignmentStepStartTime = millis();
  state.addressesModified = false;
  resetStepState();

  LOG_INFO("Entering Sensor Assignment mode");

  // Clear screen and show initial display
  tft.fillScreen(COLOR_BLACK);
  displaySensorAssignmentScreen();
}

// Update only the status area - for partial screen updates
void displayAssignmentStatusArea() {
  tft.setFont(NULL);
  int16_t x1, y1;
  uint16_t w, h;

  // Clear status area (between name and boxes)
  tft.fillRect(0, 160, TFT_WIDTH, 90, COLOR_BLACK);

  if (state.awaitingSensorRemoval) {
    tft.setTextSize(3);
    tft.setTextColor(COLOR_RED);
    tft.getTextBounds("REMOVE", 0, 0, &x1, &y1, &w, &h);
    tft.setCursor((TFT_WIDTH - w) / 2, 170);
    tft.print("REMOVE");
    tft.setTextSize(2);
    tft.setTextColor(COLOR_YELLOW);
    tft.getTextBounds("sensor to continue", 0, 0, &x1, &y1, &w, &h);
    tft.setCursor((TFT_WIDTH - w) / 2, 210);
    tft.print("sensor to continue");
  } else if (state.sensorDetectedForStep) {
    // Sensor detected - show temperature and address
    tft.setTextSize(3);
    tft.setTextColor(COLOR_GREEN);

    char tempStr[16];
    snprintf(tempStr, sizeof(tempStr), "%.1fC", state.detectedTemperature);
    tft.getTextBounds(tempStr, 0, 0, &x1, &y1, &w, &h);
    tft.setCursor((TFT_WIDTH - w) / 2, 165);
    tft.print(tempStr);

    tft.setTextSize(2);
    char addrStr[20];
    snprintf(addrStr, sizeof(addrStr), "%02X:%02X:%02X:%02X",
             state.detectedAddress[0], state.detectedAddress[1],
             state.detectedAddress[2], state.detectedAddress[3]);
    tft.getTextBounds(addrStr, 0, 0, &x1, &y1, &w, &h);
    tft.setCursor((TFT_WIDTH - w) / 2, 195);
    tft.print(addrStr);

    tft.setTextColor(COLOR_YELLOW);
    tft.getTextBounds("Touch to save", 0, 0, &x1, &y1, &w, &h);
    tft.setCursor((TFT_WIDTH - w) / 2, 225);
    tft.print("Touch to save");
  } else {
    // Waiting for sensor
    tft.setTextSize(3);
    tft.setTextColor(COLOR_YELLOW);
    tft.getTextBounds("Attach Sensor", 0, 0, &x1, &y1, &w, &h);
    tft.setCursor((TFT_WIDTH - w) / 2, 170);
    tft.print("Attach Sensor");

    tft.setTextSize(2);
    tft.getTextBounds("Tap=skip 5s=clear", 0, 0, &x1, &y1, &w, &h);
    tft.setCursor((TFT_WIDTH - w) / 2, 210);
    tft.print("Tap=skip 5s=clear");
  }
}

void displaySensorAssignmentScreen() {
  tft.setFont(NULL);
  tft.setTextSize(2);
  tft.setTextColor(COLOR_CYAN);
  int16_t x1, y1;
  uint16_t w, h;

  // Clear content area
  tft.fillRect(0, STATUSBAR_HEIGHT, TFT_WIDTH, TFT_HEIGHT - STATUSBAR_HEIGHT, COLOR_BLACK);

