RandMental/LTC---4-Zone-Temperature-Controller/ESP32_Victron_Dual_DS1820_MQTT_7735_v2/ESP32_Victron_Dual_DS1820_MQTT_7735_v2.ino
  // Title - centered
  tft.getTextBounds("SENSOR SETUP", 0, 0, &x1, &y1, &w, &h);
  tft.setCursor((TFT_WIDTH - w) / 2, TITLE_Y);
  tft.print("SENSOR SETUP");

  // Horizontal line under title
  tft.drawFastHLine(20, TITLE_LINE_Y, TFT_WIDTH - 40, COLOR_CYAN);

  if (state.operatingMode == MODE_SENSOR_CLEAR_BUS) {
    // Show "Remove All Sensors" message
    tft.setTextSize(3);
    tft.setTextColor(COLOR_RED);
    tft.getTextBounds("REMOVE", 0, 0, &x1, &y1, &w, &h);
    tft.setCursor((TFT_WIDTH - w) / 2, 90);
    tft.print("REMOVE");
    tft.getTextBounds("ALL", 0, 0, &x1, &y1, &w, &h);
    tft.setCursor((TFT_WIDTH - w) / 2, 130);
    tft.print("ALL");
    tft.getTextBounds("SENSORS", 0, 0, &x1, &y1, &w, &h);
    tft.setCursor((TFT_WIDTH - w) / 2, 170);
    tft.print("SENSORS");
  } else {
    // MODE_SENSOR_ASSIGNMENT - show current sensor
    tft.setTextSize(2);
    char progress[8];
    snprintf(progress, sizeof(progress), "[%d/%d]", state.currentSensorIndex + 1, NUM_TEMP_SENSORS);
    tft.getTextBounds(progress, 0, 0, &x1, &y1, &w, &h);
    tft.setCursor((TFT_WIDTH - w) / 2, PROGRESS_Y);
    tft.print(progress);

    // Sensor name - centered, larger
    tft.setTextSize(3);
    tft.setTextColor(COLOR_CYAN);
    const char* sensorName = cfg.deviceNames[state.currentSensorIndex];
    tft.getTextBounds(sensorName, 0, 0, &x1, &y1, &w, &h);
    tft.setCursor((TFT_WIDTH - w) / 2, MODE_NAME_Y);
    tft.print(sensorName);

    // Draw status area
    displayAssignmentStatusArea();
  }

  // Visual sensor indicators at bottom
  tft.setTextSize(2);
  tft.setTextColor(COLOR_CYAN);
  int startX = (TFT_WIDTH - (NUM_TEMP_SENSORS * BOX_SPACING)) / 2;
  for (int i = 0; i < NUM_TEMP_SENSORS; i++) {
    int x = startX + (i * BOX_SPACING);
    if (i == state.currentSensorIndex) {
      if (state.sensorDetectedForStep) {
        tft.fillRect(x, BOX_Y, BOX_SIZE, BOX_SIZE, COLOR_GREEN);
        tft.setTextColor(COLOR_BLACK);
      } else {
        tft.fillRect(x, BOX_Y, BOX_SIZE, BOX_SIZE, COLOR_CYAN);
        tft.setTextColor(COLOR_BLACK);
      }
      tft.setCursor(x + 14, BOX_Y + 12);
      tft.print(i + 1);
      tft.setTextColor(COLOR_CYAN);
    } else if (i < state.currentSensorIndex) {
      tft.drawRect(x, BOX_Y, BOX_SIZE, BOX_SIZE, COLOR_CYAN);
      tft.setCursor(x + 8, BOX_Y + 12);
      tft.print("OK");
    } else {
      tft.drawRect(x, BOX_Y, BOX_SIZE, BOX_SIZE, COLOR_CYAN);
      tft.setCursor(x + 14, BOX_Y + 12);
      tft.print(i + 1);
    }
  }
}

void handleClearBusMode() {
  uint32_t elapsed = millis() - state.assignmentStepStartTime;

  // Check if bus is now clear
  oneWire.reset_search();
  byte addr[8];
  if (!oneWire.search(addr)) {
    // Bus clear - proceed to assignment
    LOG_INFO("Bus clear, starting sensor assignment");
    state.operatingMode = MODE_SENSOR_ASSIGNMENT;
    state.assignmentStepStartTime = millis();
    resetStepState();
    displaySensorAssignmentScreen();
    return;
  }

  // Timeout - reboot to normal mode
  if (elapsed >= ASSIGNMENT_TIMEOUT_MS) {
    LOG_WARN("Clear bus timeout - rebooting to normal mode");
    ESP.restart();
  }
}

void handleSensorAssignmentMode() {
  uint32_t now = millis();
  uint32_t elapsed = now - state.assignmentStepStartTime;
  bool isPressed = isInputActive();

  // State: Waiting for sensor to be removed
  if (state.awaitingSensorRemoval) {
    oneWire.reset_search();
    byte addr[8];
    if (!oneWire.search(addr)) {
      // Sensor removed - advance to next
      LOG_INFO("Sensor removed, advancing to next");
      advanceToNextSensor();
    }
    return;
  }

  // Handle button confirmation state machine
  if (state.awaitingConfirmRelease) {
    // Waiting for 1 second after button release
    if (now - state.confirmButtonReleaseTime >= CONFIRM_RELEASE_DELAY_MS) {
      // 1 second has passed - process the confirmation
      if (state.sensorDetectedForStep) {
        // Save the detected address
        memcpy(sensorAddresses[state.currentSensorIndex], state.detectedAddress, 8);
        state.addressesModified = true;
        LOG_INFO("Sensor %d saved: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X",
                 state.currentSensorIndex,
                 state.detectedAddress[0], state.detectedAddress[1],
                 state.detectedAddress[2], state.detectedAddress[3],
                 state.detectedAddress[4], state.detectedAddress[5],
                 state.detectedAddress[6], state.detectedAddress[7]);

        // Now wait for sensor removal before advancing
        state.awaitingConfirmRelease = false;
        state.awaitingSensorRemoval = true;
        displayAssignmentStatusArea();  // Update display to show "Remove sensor"
        LOG_INFO("Waiting for sensor removal");
      } else {
        // No sensor detected - keep original address, advance immediately
        LOG_INFO("Sensor %d skipped - keeping original address", state.currentSensorIndex);
        advanceToNextSensor();
      }
      return;
    }
    // Still waiting - don't process anything else
    return;
  }

  // Track button press for confirmation
  if (isPressed) {
    if (!state.confirmButtonWasPressed) {
      // Button just pressed
      state.confirmButtonWasPressed = true;
      state.confirmButtonPressStart = now;
      LOG_DEBUG("Confirm button pressed");
    } else if (!state.sensorDetectedForStep) {
      // Button held while waiting for sensor - check for 5 second hold to clear memory
      uint32_t holdDuration = now - state.confirmButtonPressStart;
      if (holdDuration >= LONG_PRESS_MS) {
        // 5 second hold - clear this sensor's address
        LOG_INFO("Clearing sensor %d address (5s hold)", state.currentSensorIndex);

        // Set to placeholder address
        memset(sensorAddresses[state.currentSensorIndex], 0, 8);
        sensorAddresses[state.currentSensorIndex][0] = 0x28;  // DS18B20 family code
        state.addressesModified = true;

        // Display "Memory Cleared" message (scaled)
        tft.fillRect(0, 75, TFT_WIDTH, 45, COLOR_BLACK);
        tft.setFont(NULL);
        tft.setTextSize(2);
        tft.setTextColor(COLOR_MAGENTA);
        int16_t x1, y1;
        uint16_t w, h;
        tft.getTextBounds("MEMORY", 0, 0, &x1, &y1, &w, &h);
        tft.setCursor((TFT_WIDTH - w) / 2, 80);
        tft.print("MEMORY");
        tft.getTextBounds("CLEARED", 0, 0, &x1, &y1, &w, &h);
        tft.setCursor((TFT_WIDTH - w) / 2, 100);
        tft.print("CLEARED");

        delay(1000);
        feedWatchdog();

        // Reset button state and advance
        state.confirmButtonWasPressed = false;
        advanceToNextSensor();
        return;
      }
    }
  } else {
    if (state.confirmButtonWasPressed) {
      // Button just released
      uint32_t pressDuration = now - state.confirmButtonPressStart;
      state.confirmButtonWasPressed = false;

      if (pressDuration >= CONFIRM_PRESS_MIN_MS && pressDuration < LONG_PRESS_MS) {
        // Valid press (>200ms but <5s) - start release delay
        state.awaitingConfirmRelease = true;
        state.confirmButtonReleaseTime = now;
        LOG_INFO("Button released after %lu ms, waiting 1s before processing", pressDuration);
        return;
      }
      // Too short or was a long press (already handled) - ignore
    }
  }

  // If sensor not yet detected for this step, scan for one
  if (!state.sensorDetectedForStep) {
    oneWire.reset_search();
    byte addr[8];
    if (oneWire.search(addr)) {
      // Validate CRC
      if (OneWire::crc8(addr, 7) == addr[7]) {
        // Valid sensor found - store temporarily and read temperature
        memcpy(state.detectedAddress, addr, 8);
        state.sensorDetectedForStep = true;

        // Request and read temperature
        sensors.requestTemperaturesByAddress(addr);
        delay(200);  // Brief delay for conversion
        state.detectedTemperature = sensors.getTempC(addr);

        LOG_INFO("Sensor %d detected: %02X:%02X:%02X:%02X, Temp: %.1fC",
                 state.currentSensorIndex,
                 addr[0], addr[1], addr[2], addr[3],
                 state.detectedTemperature);

        // Update only the status area (partial screen update)
        displayAssignmentStatusArea();
        feedWatchdog();
      }
    }
  }

