RandMental/LTC---4-Zone-Temperature-Controller/ESP32_Victron_Dual_DS1820_MQTT_7735_v2/ESP32_Victron_Dual_DS1820_MQTT_7735_v2.ino
  // Timeout - reboot (no sensor connected in time)
  if (elapsed >= ASSIGNMENT_TIMEOUT_MS) {
    LOG_WARN("Sensor %d timeout - rebooting", state.currentSensorIndex);
    if (state.addressesModified) {
      saveSensorAddresses();
    }
    ESP.restart();
  }
}

void advanceToNextSensor() {
  state.currentSensorIndex++;
  state.assignmentStepStartTime = millis();
  resetStepState();

  if (state.currentSensorIndex >= NUM_TEMP_SENSORS) {
    // All sensors assigned - save and reboot
    LOG_INFO("All sensors assigned, saving and rebooting");
    tft.fillScreen(COLOR_BLACK);
    tft.setFont(NULL);
    tft.setTextSize(2);
    tft.setTextColor(COLOR_GREEN);
    // Center text: "Storing"=7*12=84px, "addresses"/"Rebooting"=9*12=108px
    // Vertical: 3 lines * 16px + 2 gaps * 10px = 68px, start Y=(160-68)/2=46
    tft.setCursor((128 - 84) / 2, 46);
    tft.print("Storing");
    tft.setCursor((128 - 108) / 2, 72);
    tft.print("addresses");
    tft.setCursor((128 - 108) / 2, 98);
    tft.print("Rebooting");

    delay(2000);
    feedWatchdog();
    if (state.addressesModified) {
      saveSensorAddresses();
    }
    ESP.restart();
  } else {
    // Show next sensor screen
    displaySensorAssignmentScreen();
  }
}

void exitAssignmentMode(bool saveAndReboot) {
  if (saveAndReboot && state.addressesModified) {
    tft.fillScreen(COLOR_BLACK);
    tft.setFont(NULL);
    tft.setTextSize(2);
    tft.setTextColor(COLOR_GREEN);
    int16_t x1, y1;
    uint16_t w, h;
    // Center text vertically and horizontally (scaled)
    tft.getTextBounds("Storing", 0, 0, &x1, &y1, &w, &h);
    tft.setCursor((TFT_WIDTH - w) / 2, 46);
    tft.print("Storing");
    tft.getTextBounds("addresses", 0, 0, &x1, &y1, &w, &h);
    tft.setCursor((TFT_WIDTH - w) / 2, 72);
    tft.print("addresses");
    tft.getTextBounds("Rebooting", 0, 0, &x1, &y1, &w, &h);
    tft.setCursor((TFT_WIDTH - w) / 2, 98);
    tft.print("Rebooting");
    delay(2000);
    feedWatchdog();
    saveSensorAddresses();
    ESP.restart();
  } else {
    ESP.restart();  // Always reboot to return to normal mode cleanly
  }
}

// ================================ DISPLAY FUNCTIONS ================================

// Helper function to draw scaled bitmaps (scales by ICON_SCALE)
void drawScaledBitmap(int16_t x, int16_t y, const uint8_t* bitmap, int16_t w, int16_t h, uint16_t color) {
#if ICON_SCALE == 1
  // No scaling needed - direct draw
  tft.drawBitmap(x, y, bitmap, w, h, color);
#else
  // Scale up the bitmap by drawing each pixel as a ICON_SCALE x ICON_SCALE block
  for (int16_t j = 0; j < h; j++) {
    for (int16_t i = 0; i < w; i++) {
      // Read pixel from bitmap (1 bit per pixel, MSB first)
      uint8_t byte = bitmap[j * ((w + 7) / 8) + i / 8];
      if (byte & (0x80 >> (i & 7))) {
        // Pixel is set - draw scaled block
        tft.fillRect(x + (i * ICON_SCALE), y + (j * ICON_SCALE), ICON_SCALE, ICON_SCALE, color);
      }
    }
  }
#endif
}

void initDisplay() {
  // Initialize ILI9342 3.2" 240x320 display (hardware SPI only)
  SPI.begin(TFT_SCLK, TFT_MISO, TFT_MOSI, TFT_CS);
  tft.begin(10000000);
  tft.setRotation(cfg.tftRotation);
  tft.invertDisplay(false);
  tft.fillScreen(COLOR_BLACK);
}

void displayStatusBar() {
  // Determine current WiFi color band for cache comparison
  int rssiLevel = 0;  // 0=green, 1=yellow, 2=red
  if (state.wifiRSSI < -80) rssiLevel = 2;
  else if (state.wifiRSSI < -70) rssiLevel = 1;

  int cachedRssiLevel = 0;
  if (displayCache.wifiRSSI < -80) cachedRssiLevel = 2;
  else if (displayCache.wifiRSSI < -70) cachedRssiLevel = 1;

  // Update WiFi indicator only if changed
  bool wifiChanged = (state.wifiConnected != displayCache.wifiConnected) || (state.wifiConnected && (rssiLevel != cachedRssiLevel));
  if (wifiChanged) {
    // Clear WiFi icon area (left side)
    tft.fillRect(0, STATUSBAR_Y, 40, STATUSBAR_HEIGHT, COLOR_BLACK);

    uint16_t wifiColor = COLOR_GREEN;
    if (rssiLevel == 1) wifiColor = COLOR_YELLOW;
    if (rssiLevel == 2) wifiColor = COLOR_RED;

    if (state.wifiConnected) {
      tft.drawBitmap(WIFI_ICON_X, WIFI_ICON_Y, wifi_icon, 32, 22, wifiColor);
    } else {
      tft.drawBitmap(WIFI_ICON_X, WIFI_ICON_Y, wifi_icon, 32, 22, COLOR_RED);
      // Draw X over disconnected icon
      tft.drawLine(WIFI_ICON_X, WIFI_ICON_Y, WIFI_ICON_X + 32, WIFI_ICON_Y + 22, COLOR_RED);
    }
    displayCache.wifiConnected = state.wifiConnected;
    displayCache.wifiRSSI = state.wifiRSSI;
  }

  // Update MQTT indicator only if changed (right side of screen)
  if (state.mqttConnected != displayCache.mqttConnected) {
    // Clear MQTT text area
    tft.fillRect(TFT_WIDTH - 60, STATUSBAR_Y, 60, STATUSBAR_HEIGHT, COLOR_BLACK);

    tft.setFont(NULL);
    tft.setTextSize(2);
    tft.setTextColor(state.mqttConnected ? COLOR_GREEN : COLOR_RED);
    tft.setCursor(TFT_WIDTH - 55, 8);
    tft.print(state.mqttConnected ? "MQTT" : "----");
    displayCache.mqttConnected = state.mqttConnected;
  }

  // Update SD card icon if state changed
  if (cfg.sdCardPresent != displayCache.sdCardShown) {
    tft.fillRect(SD_ICON_X, STATUSBAR_Y, SD_ICON_W, STATUSBAR_HEIGHT, COLOR_BLACK);
    if (cfg.sdCardPresent) {
      tft.drawBitmap(SD_ICON_X, SD_ICON_Y, sd_card_icon, SD_ICON_W, SD_ICON_H, COLOR_WHITE);
    }
    displayCache.sdCardShown = cfg.sdCardPresent;
  }

  // Update IP address - only show when WiFi connected and signal green
  bool showIP = state.wifiConnected && rssiLevel == 0;
  String ipStr = showIP ? WiFi.localIP().toString() : String("");
  const char* currentIP = ipStr.c_str();
  if (strcmp(currentIP, displayCache.lastIP) != 0) {
    tft.fillRect(IP_TEXT_X, STATUSBAR_Y, 96, STATUSBAR_HEIGHT, COLOR_BLACK);
    if (showIP) {
      tft.setFont(NULL);
      tft.setTextSize(1);
      tft.setTextColor(COLOR_WHITE);
      tft.setCursor(IP_TEXT_X, IP_TEXT_Y);
      tft.print(WiFi.localIP());
    }
    strncpy(displayCache.lastIP, currentIP, sizeof(displayCache.lastIP) - 1);
    displayCache.lastIP[sizeof(displayCache.lastIP) - 1] = '\0';
  }
}

void displayLocalTime() {
  struct tm timeinfo;
  if (!getLocalTime(&timeinfo)) return;

  tft.setTextSize(1);  // Reset before using custom fonts

  int8_t curHour = timeinfo.tm_hour;
  int8_t curMinute = timeinfo.tm_min;
  int8_t curDay = timeinfo.tm_mday;
  int8_t curMonth = timeinfo.tm_mon;
  int16_t curYear = timeinfo.tm_year + 1900;

  bool timeChanged = (curHour != displayCache.hour) || (curMinute != displayCache.minute);
  bool dateChanged = (curDay != displayCache.day) || (curMonth != displayCache.month) || (curYear != displayCache.year);

