RandMental/LTC---4-Zone-Temperature-Controller/ESP32_Victron_Dual_DS1820_MQTT_7735_v2/ESP32_Victron_Dual_DS1820_MQTT_7735_v2.ino
  int16_t x1, y1;
  uint16_t w, h;

  if (timeChanged) {
    // Clear time row
    tft.fillRect(0, TIME_ROW_Y, TFT_WIDTH, TIME_ROW_HEIGHT, COLOR_BLACK);

    char timeStr[8];
    snprintf(timeStr, sizeof(timeStr), "%02d:%02d", curHour, curMinute);

    tft.setFont(font_large);
    tft.setTextColor(COLOR_GREEN);
    tft.getTextBounds(timeStr, 0, 0, &x1, &y1, &w, &h);
    tft.setCursor((TFT_WIDTH - w) / 2, TIME_BASELINE_Y);
    tft.print(timeStr);

    displayCache.hour = curHour;
    displayCache.minute = curMinute;
  }

  if (dateChanged) {
    // Clear date row
    tft.fillRect(0, DATE_ROW_Y, TFT_WIDTH, DATE_ROW_HEIGHT, COLOR_BLACK);

    char dayMonth[4], monthName[5], yearStr[6];
    strftime(dayMonth, sizeof(dayMonth), "%d", &timeinfo);
    strftime(monthName, sizeof(monthName), "%b", &timeinfo);
    strftime(yearStr, sizeof(yearStr), "%Y", &timeinfo);

    char dateStr[16];
    snprintf(dateStr, sizeof(dateStr), "%s %s %s", dayMonth, monthName, yearStr);

    tft.setFont(font_small);
    tft.setTextColor(COLOR_CYAN);
    tft.getTextBounds(dateStr, 0, 0, &x1, &y1, &w, &h);
    tft.setCursor((TFT_WIDTH - w) / 2, DATE_BASELINE_Y);
    tft.print(dateStr);

    displayCache.day = curDay;
    displayCache.month = curMonth;
    displayCache.year = curYear;
  }
}

uint16_t getTemperatureColor(float temp, uint8_t deviceIndex) {
  if (deviceIndex >= NUM_TEMP_SENSORS) return COLOR_WHITE;
  if (temp >= cfg.tempFanOn[deviceIndex]) return COLOR_RED;
  if (temp >= cfg.tempFanOff[deviceIndex]) return COLOR_YELLOW;
  return COLOR_GREEN;
}

void displayDevice(uint8_t deviceNumber) {
  if (deviceNumber >= NUM_TEMP_SENSORS) return;

  float temp = state.tempSensors[deviceNumber].filtered;
  bool sensorValid = state.tempSensors[deviceNumber].valid;
  bool sensorEnabled = state.tempSensors[deviceNumber].enabled;
  bool fanOn = state.fanStates[deviceNumber];

  bool screenChanged = (displayCache.lastScreen != (int8_t)deviceNumber);

  // Determine color based on temperature/status
  uint16_t colour;
  if (!sensorEnabled) colour = COLOR_ORANGE;
  else if (!sensorValid) colour = COLOR_MAGENTA;
  else colour = getTemperatureColor(temp, deviceNumber);

  tft.setTextSize(1);

  // Build temperature string
  char tempStr[12];
  if (!sensorEnabled) {
    snprintf(tempStr, sizeof(tempStr), "N/C");
  } else if (sensorValid) {
    snprintf(tempStr, sizeof(tempStr), "%.1f\xB0"
                                       "C",
             temp);
  } else {
    snprintf(tempStr, sizeof(tempStr), "ERR");
  }

  int16_t x1, y1;
  uint16_t w, h;

  // Calculate name + fan icon positioning (fan icon to right of name, both centered together)
  tft.setFont(font_small);
  tft.getTextBounds(cfg.deviceNames[deviceNumber], 0, 0, &x1, &y1, &w, &h);
  int nameW = w;
  int nameH = h;
  int scaledFanW = FAN_ICON_W * ICON_SCALE;
  int scaledFanH = FAN_ICON_H * ICON_SCALE;
  int nameGap = 10;  // Gap between name and fan icon
  int totalNameWidth = nameW + (fanOn ? (nameGap + scaledFanW) : 0);
  int nameX = (TFT_WIDTH - totalNameWidth) / 2;
  int fanIconX = nameX + nameW + nameGap;
  int fanIconY = NAME_ROW_Y + (NAME_ROW_HEIGHT - scaledFanH) / 2;  // Vertically center fan icon

  // Calculate temperature icon + value positioning (centered together)
  tft.setFont(font_large);
  tft.getTextBounds(tempStr, 0, 0, &x1, &y1, &w, &h);
  int tempTextW = w;
  int scaledTempIconW = TEMP_ICON_W * ICON_SCALE;
  int scaledTempIconH = TEMP_ICON_H * ICON_SCALE;
  int tempGap = 10;  // Gap between icon and value
  int totalTempWidth = scaledTempIconW + tempGap + tempTextW;
  int tempIconX = (TFT_WIDTH - totalTempWidth) / 2;
  int tempValueX = tempIconX + scaledTempIconW + tempGap;
  int tempIconY = (TEMP_ROW_Y + (TEMP_ROW_HEIGHT - scaledTempIconH) / 2) + 16;

  if (screenChanged) {
    // Clear name row, temp row, and humidity row (leftover from ambient screen)
    tft.fillRect(0, NAME_ROW_Y, TFT_WIDTH, NAME_ROW_HEIGHT, COLOR_BLACK);
    tft.fillRect(0, TEMP_ROW_Y, TFT_WIDTH, TEMP_ROW_HEIGHT, COLOR_BLACK);
    tft.fillRect(0, HUM_ROW_Y, TFT_WIDTH, HUM_ROW_HEIGHT, COLOR_BLACK);

    // Draw device name (centered with fan icon if on)
    tft.setFont(font_small);
    tft.setTextColor(COLOR_CYAN);
    tft.setCursor(nameX, NAME_BASELINE_Y);
    tft.print(cfg.deviceNames[deviceNumber]);

    // Draw fan icon if on (to right of name, vertically centered)
    if (fanOn) {
      drawScaledBitmap(fanIconX, fanIconY, fan_icon, FAN_ICON_W, FAN_ICON_H, COLOR_CYAN);
    }

    // Draw temperature icon (centered with value)
    drawScaledBitmap(tempIconX, tempIconY, temperature_icon, TEMP_ICON_W, TEMP_ICON_H, colour);

    // Draw temperature value
    tft.setFont(font_large);
    tft.setTextColor(colour);
    tft.setCursor(tempValueX, TEMP_BASELINE_Y);
    tft.print(tempStr);

    // Update cache
    displayCache.lastScreen = (int8_t)deviceNumber;
    displayCache.lastTemp = temp;
    displayCache.lastFanState = fanOn;
    displayCache.lastSensorValid = sensorValid;
    displayCache.lastSensorEnabled = sensorEnabled;
  } else {
    // Same screen - only update changed values
    bool tempChanged = (abs(temp - displayCache.lastTemp) > 0.05f) || (sensorValid != displayCache.lastSensorValid) || (sensorEnabled != displayCache.lastSensorEnabled);
    bool fanChanged = (fanOn != displayCache.lastFanState);

    if (fanChanged) {
      // Clear and redraw entire name row (fan icon position changes)
      tft.fillRect(0, NAME_ROW_Y, TFT_WIDTH, NAME_ROW_HEIGHT, COLOR_BLACK);

      // Recalculate with new fan state
      totalNameWidth = nameW + (fanOn ? (nameGap + scaledFanW) : 0);
      nameX = (TFT_WIDTH - totalNameWidth) / 2;
      fanIconX = nameX + nameW + nameGap;

      tft.setFont(font_small);
      tft.setTextColor(COLOR_CYAN);
      tft.setCursor(nameX, NAME_BASELINE_Y);
      tft.print(cfg.deviceNames[deviceNumber]);

      if (fanOn) {
        drawScaledBitmap(fanIconX, fanIconY, fan_icon, FAN_ICON_W, FAN_ICON_H, COLOR_CYAN);
      }
      displayCache.lastFanState = fanOn;
    }

