RandMental/LTC---4-Zone-Temperature-Controller/ESP32_Victron_Dual_DS1820_MQTT_7735_v2/ESP32_Victron_Dual_DS1820_MQTT_7735_v2.ino
    if (tempChanged) {
      // Clear and redraw temperature row
      tft.fillRect(0, TEMP_ROW_Y, TFT_WIDTH, TEMP_ROW_HEIGHT, COLOR_BLACK);

      drawScaledBitmap(tempIconX, tempIconY, temperature_icon, TEMP_ICON_W, TEMP_ICON_H, colour);

      tft.setFont(font_large);
      tft.setTextColor(colour);
      tft.setCursor(tempValueX, TEMP_BASELINE_Y);
      tft.print(tempStr);

      displayCache.lastTemp = temp;
      displayCache.lastSensorValid = sensorValid;
      displayCache.lastSensorEnabled = sensorEnabled;
    }
  }
}

void displayAmbient() {
  const int8_t AMBIENT_SCREEN_ID = 100;

  float ambTemp = state.ambientTemp.filtered;
  float ambHum = state.ambientHum.filtered;
  bool tempValid = state.ambientTemp.valid;
  bool humValid = state.ambientHum.valid;

  bool screenChanged = (displayCache.lastScreen != AMBIENT_SCREEN_ID);

  int16_t x1, y1;
  uint16_t w, h;

  if (screenChanged) {
    // Clear name row, temp row, and humidity row
    tft.fillRect(0, NAME_ROW_Y, TFT_WIDTH, NAME_ROW_HEIGHT, COLOR_BLACK);
    tft.fillRect(0, TEMP_ROW_Y, TFT_WIDTH, TEMP_ROW_HEIGHT, COLOR_BLACK);
    tft.fillRect(0, HUM_ROW_Y, TFT_WIDTH, HUM_ROW_HEIGHT, COLOR_BLACK);

    tft.setTextSize(1);

    // "Ambient" title - centered in name row
    tft.setFont(font_small);
    tft.setTextColor(COLOR_CYAN);
    tft.getTextBounds("Ambient", 0, 0, &x1, &y1, &w, &h);
    tft.setCursor((TFT_WIDTH - w) / 2, NAME_BASELINE_Y);
    tft.print("Ambient");

    // Temperature - icon + value centered in temp row
    tft.setFont(font_large);
    char tempStr[12];
    uint16_t tempColour;
    if (tempValid) {
      tempColour = COLOR_GREEN;
      snprintf(tempStr, sizeof(tempStr), "%.1f\xB0"
                                         "C",
               ambTemp);
    } else {
      tempColour = COLOR_MAGENTA;
      snprintf(tempStr, sizeof(tempStr), "--.-\xB0"
                                         "C");
    }
    tft.getTextBounds(tempStr, 0, 0, &x1, &y1, &w, &h);
    int tempTextW = w;
    int scaledTempIconW = TEMP_ICON_W * ICON_SCALE;
    int scaledTempIconH = TEMP_ICON_H * ICON_SCALE;
    int tempGap = 10;
    int totalTempWidth = scaledTempIconW + tempGap + tempTextW;
    int tempIconX = (TFT_WIDTH - totalTempWidth) / 2;
    int tempValueX = tempIconX + scaledTempIconW + tempGap;
    int tempIconY = (TEMP_ROW_Y + (TEMP_ROW_HEIGHT - scaledTempIconH) / 2) + 16;

    drawScaledBitmap(tempIconX, tempIconY, temperature_icon, TEMP_ICON_W, TEMP_ICON_H, tempColour);
    tft.setTextColor(tempColour);
    tft.setCursor(tempValueX, TEMP_BASELINE_Y);
    tft.print(tempStr);

    // Humidity - icon + value centered in humidity row
    char humStr[12];
    uint16_t humColour;
    if (humValid) {
      humColour = COLOR_BLUE;
      snprintf(humStr, sizeof(humStr), "%.0f%%", ambHum);
    } else {
      humColour = COLOR_MAGENTA;
      snprintf(humStr, sizeof(humStr), "--%%");
    }
    tft.setFont(font_large);
    tft.getTextBounds(humStr, 0, 0, &x1, &y1, &w, &h);
    int humTextW = w;
    int humIconW = 32;
    int humIconH = 42;
    int humGap = 10;
    int totalHumWidth = humIconW + humGap + humTextW;
    int humIconX = (TFT_WIDTH - totalHumWidth) / 2;
    int humValueX = humIconX + humIconW + humGap;
    int humIconY = HUM_ROW_Y + (HUM_ROW_HEIGHT - humIconH) / 2;
    int humIconCenterY = humIconY + humIconH / 2;
    int humTextY = humIconCenterY - y1 - h / 2;

    tft.drawBitmap(humIconX, humIconY, humidity_icon_32x42, 32, 42, humColour);
    tft.setTextColor(humColour);
    tft.setCursor(humValueX, humTextY);
    tft.print(humStr);

    // Update cache
    displayCache.lastScreen = AMBIENT_SCREEN_ID;
    displayCache.lastAmbientTemp = ambTemp;
    displayCache.lastAmbientHum = ambHum;
    displayCache.lastAmbientTempValid = tempValid;
    displayCache.lastAmbientHumValid = humValid;
  } else {
    // Same screen - only update changed values
    bool tempChanged = (abs(ambTemp - displayCache.lastAmbientTemp) > 0.05f) || (tempValid != displayCache.lastAmbientTempValid);
    bool humChanged = (abs(ambHum - displayCache.lastAmbientHum) > 0.5f) || (humValid != displayCache.lastAmbientHumValid);

    if (tempChanged) {
      // Clear and redraw temperature row
      tft.fillRect(0, TEMP_ROW_Y, TFT_WIDTH, TEMP_ROW_HEIGHT, COLOR_BLACK);

      tft.setFont(font_large);
      tft.setTextSize(1);
      char tempStr[12];
      uint16_t tempColour;
      if (tempValid) {
        tempColour = COLOR_GREEN;
        snprintf(tempStr, sizeof(tempStr), "%.1f\xB0"
                                           "C",
                 ambTemp);
      } else {
        tempColour = COLOR_MAGENTA;
        snprintf(tempStr, sizeof(tempStr), "--.-\xB0"
                                           "C");
      }
      tft.getTextBounds(tempStr, 0, 0, &x1, &y1, &w, &h);
      int tempTextW = w;
      int scaledTempIconW = TEMP_ICON_W * ICON_SCALE;
      int scaledTempIconH = TEMP_ICON_H * ICON_SCALE;
      int tempGap = 10;
      int totalTempWidth = scaledTempIconW + tempGap + tempTextW;
      int tempIconX = (TFT_WIDTH - totalTempWidth) / 2;
      int tempValueX = tempIconX + scaledTempIconW + tempGap;
      int tempIconY = (TEMP_ROW_Y + (TEMP_ROW_HEIGHT - scaledTempIconH) / 2) + 16;

      drawScaledBitmap(tempIconX, tempIconY, temperature_icon, TEMP_ICON_W, TEMP_ICON_H, tempColour);
      tft.setTextColor(tempColour);
      tft.setCursor(tempValueX, TEMP_BASELINE_Y);
      tft.print(tempStr);

      displayCache.lastAmbientTemp = ambTemp;
      displayCache.lastAmbientTempValid = tempValid;
    }

    if (humChanged) {
      // Clear and redraw humidity row
      tft.fillRect(0, HUM_ROW_Y, TFT_WIDTH, HUM_ROW_HEIGHT, COLOR_BLACK);

      tft.setFont(font_large);
      tft.setTextSize(1);
      char humStr[12];
      uint16_t humColour;
      if (humValid) {
        humColour = COLOR_BLUE;
        snprintf(humStr, sizeof(humStr), "%.0f%%", ambHum);
      } else {
        humColour = COLOR_MAGENTA;
        snprintf(humStr, sizeof(humStr), "--%%");
      }
      tft.getTextBounds(humStr, 0, 0, &x1, &y1, &w, &h);
      int humTextW = w;
      int humIconW = 32;
      int humIconH = 42;
      int humGap = 10;
      int totalHumWidth = humIconW + humGap + humTextW;
      int humIconX = (TFT_WIDTH - totalHumWidth) / 2;
      int humValueX = humIconX + humIconW + humGap;
      int humIconY = HUM_ROW_Y + (HUM_ROW_HEIGHT - humIconH) / 2;
      int humIconCenterY = humIconY + humIconH / 2;
      int humTextY = humIconCenterY - y1 - h / 2;

