RandMental/LTC---4-Zone-Temperature-Controller/ESP32_Victron_Dual_DS1820_MQTT_7735_v2/ESP32_Victron_Dual_DS1820_MQTT_7735_v2.ino
      tft.drawBitmap(humIconX, humIconY, humidity_icon_32x42, 32, 42, humColour);
      tft.setTextColor(humColour);
      tft.setCursor(humValueX, humTextY);
      tft.print(humStr);

      displayCache.lastAmbientHum = ambHum;
      displayCache.lastAmbientHumValid = humValid;
    }
  }
}

void updateDisplay() {
  displayStatusBar();
  displayLocalTime();

  // Display current screen (ambient is NUM_TEMP_SENSORS)
  if (state.displayScreen < NUM_TEMP_SENSORS) {
    displayDevice(state.displayScreen);
  } else {
    displayAmbient();
  }

  // Advance to next enabled sensor or ambient
  do {
    state.displayScreen++;
    if (state.displayScreen > NUM_TEMP_SENSORS) {
      state.displayScreen = 0;
    }
  } while (state.displayScreen < NUM_TEMP_SENSORS && !state.tempSensors[state.displayScreen].enabled);
}

// ================================ SENSOR FUNCTIONS ================================
void initSensors() {
  sensors.begin();
  sensors.setWaitForConversion(false);
  dht.begin();

  // Log how many sensors the library found on the bus
  uint8_t deviceCount = sensors.getDeviceCount();
  LOG_INFO("DallasTemperature found %d devices on OneWire bus", deviceCount);

  uint8_t configuredCount = 0;
  for (int i = 0; i < NUM_TEMP_SENSORS; i++) {
    if (isSensorAddressValid(i)) {
      // Check if this address actually exists on the bus
      bool found = sensors.isConnected(sensorAddresses[i]);
      sensors.setResolution(sensorAddresses[i], 12);
      state.tempSensors[i].enabled = true;
      configuredCount++;
      LOG_INFO("Sensor %d (%s): enabled, addr=%02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X, connected=%s",
               i, cfg.deviceNames[i],
               sensorAddresses[i][0], sensorAddresses[i][1],
               sensorAddresses[i][2], sensorAddresses[i][3],
               sensorAddresses[i][4], sensorAddresses[i][5],
               sensorAddresses[i][6], sensorAddresses[i][7],
               found ? "YES" : "NO");
    } else {
      state.tempSensors[i].enabled = false;
      LOG_INFO("Sensor %d (%s): disabled (invalid address)", i, cfg.deviceNames[i]);
    }
  }

  LOG_INFO("Sensors: %d DS18B20 configured, 1 DHT22", configuredCount);
}

void initRelays() {
  // FAILSAFE design: configured sensors start with fan ON until first valid reading
  // Unused sensors (invalid address) start with fan OFF
  for (int i = 0; i < NUM_FANS; i++) {
    pinMode(FAN_RELAY_PINS[i], OUTPUT);
    if (isSensorAddressValid(i)) {
      // Valid sensor - start with fan ON (failsafe until we get readings)
      digitalWrite(FAN_RELAY_PINS[i], fanOnState);
      state.fanStates[i] = true;
      LOG_INFO("Fan %d (%s): ON (failsafe start)", i, cfg.deviceNames[i]);
    } else {
      // No sensor configured - fan OFF
      digitalWrite(FAN_RELAY_PINS[i], fanOffState);
      state.fanStates[i] = false;
      LOG_INFO("Fan %d (%s): OFF (no sensor)", i, cfg.deviceNames[i]);
    }
  }
  LOG_INFO("Fan relays initialized (failsafe mode, active_%s)", cfg.fanActiveLow ? "low" : "high");
}

void readAllSensors() {
  static bool conversionStarted = false;
  static uint32_t conversionStartTime = 0;

  if (!conversionStarted) {
    sensors.requestTemperatures();
    conversionStarted = true;
    conversionStartTime = millis();
    return;
  }

  // Wait for conversion (750ms for 12-bit)
  if ((uint32_t)(millis() - conversionStartTime) < 750) {
    return;
  }

  conversionStarted = false;

  // Read DS18B20 sensors
  for (int i = 0; i < NUM_TEMP_SENSORS; i++) {
    if (!state.tempSensors[i].enabled) continue;

    float temp = sensors.getTempC(sensorAddresses[i]);
    if (temp != DEVICE_DISCONNECTED_C && temp > -50.0 && temp < 85.0) {
      state.tempSensors[i].addReading(temp);
    } else {
      state.tempSensors[i].addReading(-999);
      state.sensorErrors++;
    }
  }

  // Read DHT22
  float h = dht.readHumidity();
  float t = dht.readTemperature();

  if (!isnan(h)) state.ambientHum.addReading(h);
  else state.ambientHum.addReading(-999);

  if (!isnan(t)) state.ambientTemp.addReading(t);
  else state.ambientTemp.addReading(-999);
}

// ================================ FAN CONTROL ================================
void updateFans() {
  for (int i = 0; i < NUM_FANS; i++) {
    // Skip unconfigured sensors (fan stays off)
    if (!state.tempSensors[i].enabled) {
      continue;
    }

    // FAILSAFE: Sensor error on configured sensor = force fan ON
    if (!state.tempSensors[i].valid) {
      if (!state.fanStates[i]) {
        digitalWrite(FAN_RELAY_PINS[i], fanOnState);
        state.fanStates[i] = true;
        LOG_WARN("%s fan ON (sensor error - failsafe)", cfg.deviceNames[i]);
      }
      continue;
    }

    float temp = state.tempSensors[i].filtered;
    float criticalTemp = cfg.tempFanOn[i];

    // Hysteresis control
    if (temp >= criticalTemp && !state.fanStates[i]) {
      digitalWrite(FAN_RELAY_PINS[i], fanOnState);
      state.fanStates[i] = true;
      LOG_INFO("%s fan ON (%.1fC >= %.1fC)", cfg.deviceNames[i], temp, criticalTemp);
    } else if (temp < (criticalTemp - cfg.tempFanHysteresis) && state.fanStates[i]) {
      digitalWrite(FAN_RELAY_PINS[i], fanOffState);
      state.fanStates[i] = false;
      LOG_INFO("%s fan OFF (%.1fC < %.1fC)", cfg.deviceNames[i], temp, criticalTemp - cfg.tempFanHysteresis);
    }
  }
}

// ================================ WIFI FUNCTIONS ================================
void WiFiEvent(WiFiEvent_t event) {
  switch (event) {
    case ARDUINO_EVENT_WIFI_STA_GOT_IP:
      state.wifiConnected = true;
      state.wifiReconnectAttempts = 0;
      LOG_INFO("WiFi connected, IP: %s", WiFi.localIP().toString().c_str());
      break;
    case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
      state.wifiConnected = false;
      state.mqttConnected = false;
      LOG_WARN("WiFi disconnected");
      break;
  }
}

void initWiFi() {
  WiFi.mode(WIFI_STA);
  WiFi.setAutoReconnect(true);
  WiFi.onEvent(WiFiEvent);
  WiFi.begin(cfg.wifiSsid, cfg.wifiPassword);

  LOG_INFO("WiFi connecting to %s...", cfg.wifiSsid);

  uint32_t startTime = millis();
  while (WiFi.status() != WL_CONNECTED && (uint32_t)(millis() - startTime) < cfg.wifiConnectTimeoutMs) {
    delay(100);
    feedWatchdog();
  }
}

void handleWiFi() {
  state.wifiConnected = (WiFi.status() == WL_CONNECTED);

  if (state.wifiConnected) {
    state.wifiRSSI = WiFi.RSSI();
  } else {
    // Exponential backoff: 30s, 60s, 120s, 240s, max 5min
    uint32_t attempts = state.wifiReconnectAttempts;
    if (attempts > 4) attempts = 4;
    uint32_t backoffTime = cfg.wifiReconnectIntervalMs * (1UL << attempts);
    if (backoffTime > 300000UL) backoffTime = 300000UL;

    if ((uint32_t)(millis() - state.lastWifiCheck) >= backoffTime) {
      state.lastWifiCheck = millis();
      state.wifiReconnectAttempts++;
      LOG_INFO("WiFi reconnect attempt %lu", state.wifiReconnectAttempts);
      WiFi.disconnect();
      WiFi.begin(cfg.wifiSsid, cfg.wifiPassword);
    }
  }
}

// ================================ MQTT FUNCTIONS ================================
// Global callback for ESP32MQTTClient library
void onMqttConnect(esp_mqtt_client_handle_t client) {
  if (mqttClient.isMyTurn(client)) {
    state.mqttConnected = true;
    LOG_INFO("MQTT connected");

    // Publish online status and version
    mqttClient.publish(cfg.mqttPubStatus, "online", cfg.mqttQos, true);
    mqttClient.publish(cfg.mqttPubVersion, FIRMWARE_VERSION, cfg.mqttQos, true);
  }
}

void onMqttMessage(const std::string& topic, const std::string& payload) {
  LOG_DEBUG("MQTT RX [%s]: %s", topic.c_str(), payload.c_str());
}

// ESP32MQTTClient event handler (required by library)
#if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 0, 0)
esp_err_t handleMQTT(esp_mqtt_event_handle_t event) {
  mqttClient.onEventCallback(event);
  return ESP_OK;
}
#else
void handleMQTT(void *handler_args, esp_event_base_t base, int32_t event_id, void *event_data) {
  auto *event = static_cast<esp_mqtt_event_handle_t>(event_data);
  mqttClient.onEventCallback(event);
}
#endif

void initMQTT() {
  snprintf(mqttUri, sizeof(mqttUri), "mqtt://%s:%s@%s:%d",
           cfg.mqttUser, cfg.mqttPassword, cfg.mqttHost, cfg.mqttPort);

