RandMental/LTC---4-Zone-Temperature-Controller/ESP32_Victron_Dual_DS1820_MQTT_7735_v2/ESP32_Victron_Dual_DS1820_MQTT_7735_v2.ino
  mqttClient.setURI(mqttUri);
  mqttClient.setMqttClientName(cfg.mqttClientName);
  mqttClient.setKeepAlive(30);
  mqttClient.enableLastWillMessage(cfg.mqttPubStatus, "offline", true);
  mqttClient.setOnMessageCallback(onMqttMessage);

  mqttClient.loopStart();
  LOG_INFO("MQTT client started");
}

void publishTelemetry() {
  if (!state.mqttConnected) return;

  char payload[16];
  uint8_t publishedCount = 0;

  // Publish only enabled temperature sensors
  for (int i = 0; i < NUM_TEMP_SENSORS; i++) {
    if (!state.tempSensors[i].enabled) {
      LOG_DEBUG("Sensor %d (%s): skipped (not enabled)", i, cfg.deviceNames[i]);
      continue;
    }

    snprintf(mqttTopicTemp, sizeof(mqttTopicTemp), "%s/%s/temperature",
             cfg.mqttBaseTopic, cfg.deviceTopics[i]);

    if (state.tempSensors[i].valid) {
      snprintf(payload, sizeof(payload), "%.1f", state.tempSensors[i].filtered);
      mqttClient.publish(mqttTopicTemp, payload, cfg.mqttQos, cfg.mqttRetain);
      LOG_DEBUG("Published %s: %s", mqttTopicTemp, payload);
    }

    snprintf(mqttTopicFan, sizeof(mqttTopicFan), "%s/%s/fan",
             cfg.mqttBaseTopic, cfg.deviceTopics[i]);
    mqttClient.publish(mqttTopicFan, state.fanStates[i] ? "ON" : "OFF", cfg.mqttQos, cfg.mqttRetain);
    LOG_DEBUG("Published %s: %s", mqttTopicFan, state.fanStates[i] ? "ON" : "OFF");
    publishedCount++;
  }

  // Publish ambient data
  if (state.ambientTemp.valid) {
    snprintf(payload, sizeof(payload), "%.1f", state.ambientTemp.filtered);
    mqttClient.publish(cfg.mqttPubAmbTemp, payload, cfg.mqttQos, cfg.mqttRetain);
  }

  if (state.ambientHum.valid) {
    snprintf(payload, sizeof(payload), "%.1f", state.ambientHum.filtered);
    mqttClient.publish(cfg.mqttPubAmbHum, payload, cfg.mqttQos, cfg.mqttRetain);
  }

  state.publishCount++;
  LOG_INFO("Telemetry published: %d sensors (%lu total)", publishedCount, state.publishCount);
}

void publishStatus() {
  if (!state.mqttConnected) return;

  char payload[16];

  snprintf(payload, sizeof(payload), "%d", state.wifiRSSI);
  mqttClient.publish(cfg.mqttPubWifiRssi, payload, 0, false);

  // Publish IP address
  if (state.wifiConnected) {
    mqttClient.publish(cfg.mqttPubWifiIp, WiFi.localIP().toString().c_str(), 0, true);
  }

  uint32_t uptime = (millis() - state.bootTime) / 1000;
  snprintf(payload, sizeof(payload), "%lu", uptime);
  mqttClient.publish(cfg.mqttPubUptime, payload, 0, false);

  snprintf(payload, sizeof(payload), "%lu", ESP.getFreeHeap());
  mqttClient.publish(cfg.mqttPubHeapFree, payload, 0, false);

  LOG_DEBUG("Status published (heap: %lu)", ESP.getFreeHeap());
}

// ================================ NTP FUNCTIONS ================================
void initNTP() {
  // Use configured server as primary, public pool as fallback
  if (strlen(cfg.ntpServer) > 0) {
    configTime(cfg.gmtOffsetSec, cfg.daylightOffsetSec, cfg.ntpServer, "pool.ntp.org");
    LOG_INFO("NTP configured (primary: %s, fallback: pool.ntp.org)", cfg.ntpServer);
  } else {
    configTime(cfg.gmtOffsetSec, cfg.daylightOffsetSec, "pool.ntp.org");
    LOG_INFO("NTP configured (server: pool.ntp.org)");
  }
}

void syncNTP() {
  if (strlen(cfg.ntpServer) > 0) {
    configTime(cfg.gmtOffsetSec, cfg.daylightOffsetSec, cfg.ntpServer, "pool.ntp.org");
  } else {
    configTime(cfg.gmtOffsetSec, cfg.daylightOffsetSec, "pool.ntp.org");
  }
  LOG_INFO("NTP sync requested");
}

// ================================ WEB SERVER ================================
/**
 * @brief Generate the main HTML page with sensor data
 * @return Complete HTML string for the page
 */
String generateHtmlPage() {
  String html = R"rawhtml(
<!DOCTYPE html>
<html lang="en">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <!-- Auto-refresh via JS (pauses during firmware upload) -->
  <title>Victron Temperature Monitor</title>
  <style>
    * { box-sizing: border-box; margin: 0; padding: 0; }
    body { font-family: 'Segoe UI', Tahoma, sans-serif; background: #1a1a2e; color: #eee; padding: 20px; }
    .container { max-width: 600px; margin: 0 auto; }
    h1 { color: #00d4ff; text-align: center; margin-bottom: 20px; font-size: 1.5em; }
    .status-bar { display: flex; justify-content: space-between; background: #16213e; padding: 10px 15px; border-radius: 8px; margin-bottom: 20px; flex-wrap: wrap; gap: 10px; }
    .status-item { display: flex; align-items: center; gap: 5px; font-size: 0.9em; }
    .status-dot { width: 10px; height: 10px; border-radius: 50%; }
    .green { background: #00ff88; }
    .yellow { background: #ffcc00; }
    .red { background: #ff4444; }
    .grey { background: #666; }
    .blue { background: #00aaff; }
    .sensor-grid { display: grid; grid-template-columns: repeat(auto-fit, minmax(250px, 1fr)); gap: 15px; margin-bottom: 20px; }
    .sensor-card { background: #16213e; padding: 15px; border-radius: 8px; border-left: 4px solid #666; text-align: center; }
    .sensor-card.normal { border-left-color: #00ff88; }
    .sensor-card.warning { border-left-color: #ffcc00; }
    .sensor-card.critical { border-left-color: #ff4444; }
    .sensor-card.disabled { border-left-color: #666; opacity: 0.6; }
    .sensor-card.error { border-left-color: #ff44ff; }
    .sensor-name { font-weight: bold; color: #00d4ff; margin-bottom: 5px; }
    .sensor-temp { font-size: 2em; font-weight: bold; }
    .temp-normal { color: #00ff88; }
    .temp-warning { color: #ffcc00; }
    .temp-critical { color: #ff4444; }
    .temp-error { color: #ff44ff; }
    .fan-status { display: inline-block; padding: 3px 8px; border-radius: 4px; font-size: 0.8em; margin-top: 5px; }
    .fan-on { background: #00aaff; color: #000; }
    .fan-off { background: #444; color: #999; }
    .ambient-card { background: #16213e; padding: 15px; border-radius: 8px; border-left: 4px solid #00d4ff; margin-bottom: 20px; }
    .ambient-row { display: flex; justify-content: space-around; margin-top: 10px; }
    .ambient-item { text-align: center; }
    .ambient-value { font-size: 1.8em; font-weight: bold; color: #00ff88; }
    .ambient-label { font-size: 0.8em; color: #888; }
    .button-row { display: flex; gap: 10px; margin-bottom: 20px; flex-wrap: wrap; }
    .btn { flex: 1; min-width: 120px; padding: 12px 20px; border: none; border-radius: 8px; cursor: pointer; font-size: 1em; font-weight: bold; transition: all 0.2s; }
    .btn-test { background: #00aaff; color: #000; }
    .btn-test:hover { background: #00ccff; }
    .btn-assign { background: #aa44ff; color: #fff; }
    .btn-assign:hover { background: #cc66ff; }
    .btn-save { background: #44cc44; color: #000; }
    .btn-save:hover { background: #66ee66; }
    .btn-update { background: #ff8800; color: #000; }
    .btn-update:hover { background: #ffaa00; }
    .footer { text-align: center; color: #666; font-size: 0.8em; margin-top: 20px; padding-top: 20px; border-top: 1px solid #333; }
    .upload-form { display: none; background: #16213e; padding: 20px; border-radius: 8px; margin-bottom: 20px; }
    .upload-form.visible { display: block; }
    .upload-form input[type="file"] { margin: 10px 0; }
    .upload-form .btn-upload { background: #00ff88; color: #000; }
    .upload-progress { margin-top: 10px; }
    .config-panel { display: none; background: #16213e; padding: 20px; border-radius: 8px; margin-bottom: 20px; }
    .config-panel.visible { display: block; }
    .config-panel h3 { margin-bottom: 10px; color: #44cc44; }
    .config-panel .divider { border-top: 1px solid #333; margin: 15px 0; }
    .config-panel label { display: flex; align-items: center; gap: 8px; margin: 10px 0; cursor: pointer; color: #ccc; }
    .config-panel input[type="checkbox"] { width: 18px; height: 18px; accent-color: #44cc44; }
  </style>
</head>
<body>
  <div class="container">
    <h1>Victron Temperature Monitor</h1>
    <div class="status-bar">
      <div class="status-item">
        <span class="status-dot %WIFI_COLOR%"></span>
        <span>WiFi: %RSSI% dBm</span>
      </div>
      <div class="status-item">
        <span class="status-dot %MQTT_COLOR%"></span>
        <span>MQTT: %MQTT_STATUS%</span>
      </div>
      <div class="status-item">
        <span>%TIMESTAMP%</span>
      </div>
    </div>
    <div class="sensor-grid">
)rawhtml";

  // Add sensor cards
  for (int i = 0; i < NUM_TEMP_SENSORS; i++) {
    String cardClass = "sensor-card ";
    String tempClass = "sensor-temp ";
    String tempValue = "";

    if (!state.tempSensors[i].enabled) {
      cardClass += "disabled";
      tempClass += "temp-error";
      tempValue = "N/C";
    } else if (!state.tempSensors[i].valid) {
      cardClass += "error";
      tempClass += "temp-error";
      tempValue = "ERR";
    } else {
      float temp = state.tempSensors[i].filtered;
      if (temp >= cfg.tempFanOn[i]) {
        cardClass += "critical";
        tempClass += "temp-critical";
      } else if (temp >= cfg.tempFanOff[i]) {
        cardClass += "warning";
        tempClass += "temp-warning";
      } else {
        cardClass += "normal";
        tempClass += "temp-normal";
      }
      char tempBuf[10];
      snprintf(tempBuf, sizeof(tempBuf), "%.1f&deg;C", temp);
      tempValue = String(tempBuf);
    }

    String fanClass = state.fanStates[i] ? "fan-status fan-on" : "fan-status fan-off";
    String fanText = state.fanStates[i] ? "FAN ON" : "FAN OFF";

    html += "<div class=\"" + cardClass + "\">";
    html += "<div class=\"sensor-name\">" + String(cfg.deviceNames[i]) + "</div>";
    html += "<div class=\"" + tempClass + "\">" + tempValue + "</div>";
    html += "<span class=\"" + fanClass + "\">" + fanText + "</span>";
    html += "</div>";
  }

  html += R"rawhtml(
    </div>
    <div class="ambient-card">
      <div class="sensor-name">Ambient Environment</div>
      <div class="ambient-row">
        <div class="ambient-item">
          <div class="ambient-value">%AMB_TEMP%</div>
          <div class="ambient-label">Temperature</div>
        </div>
        <div class="ambient-item">
          <div class="ambient-value" style="color: #00aaff;">%AMB_HUM%</div>
          <div class="ambient-label">Humidity</div>
        </div>
      </div>
    </div>
    <div class="button-row">
      <button class="btn btn-test" onclick="testFans()">Test Fans</button>
      <button class="btn btn-assign" onclick="assignSensors()">Assign Sensors</button>
      <button class="btn btn-save" onclick="toggleConfigPanel()">Save Config</button>
      <button class="btn btn-update" onclick="toggleUpload()">Firmware Update</button>
    </div>
    <div class="config-panel" id="configPanel">
      <h3>SD Card Configuration</h3>
      <p style="color: #888; font-size: 0.9em; margin-bottom: 15px;">Save running config to SD card or upload a config.ini file.</p>
      <div class="button-row">
        <button class="btn btn-save" onclick="saveRunningConfig()">Save Running Config</button>
      </div>
      <div class="divider"></div>
      <h3 style="color: #ff8800;">Upload config.ini</h3>
      <form id="configUploadForm" method="POST" action="/upload-config" enctype="multipart/form-data">
        <input type="file" name="config" accept=".ini,.txt" required>
        <label><input type="checkbox" name="reboot" id="configReboot"> Reboot after saving</label>
        <div class="button-row">
          <button type="submit" class="btn btn-upload">Upload & Save</button>
          <button type="button" class="btn" style="background: #666;" onclick="toggleConfigPanel()">Cancel</button>
        </div>
      </form>
      <div id="configUploadStatus"></div>
    </div>
    <div class="upload-form" id="uploadForm">
      <h3 style="margin-bottom: 10px; color: #ff8800;">Upload New Firmware</h3>
      <form method="POST" action="/update" enctype="multipart/form-data" id="firmwareForm">
        <input type="file" name="firmware" accept=".bin" required>
        <div class="button-row">
          <button type="submit" class="btn btn-upload">Upload & Install</button>
          <button type="button" class="btn" style="background: #666;" onclick="toggleUpload()">Cancel</button>
        </div>
      </form>
      <div class="upload-progress" id="uploadProgress"></div>
    </div>
    <div class="footer">
      <p>Firmware: v%VERSION% | Uptime: %UPTIME%</p>
      <p>Free Heap: %HEAP% bytes | Boot Count: %BOOTCOUNT%</p>
    </div>
  </div>
  <script>
    function testFans() {
      fetch('/test-fans').then(r => r.text()).then(t => {
        alert(t);
        setTimeout(() => location.reload(), 1000);
      });
    }
    function assignSensors() {
      if (confirm('Enter sensor assignment mode? Device will reboot after assignment.')) {
        fetch('/assign-sensors').then(r => r.text()).then(t => { alert(t); });
      }
    }
    function saveRunningConfig() {
      if (confirm('Save current running config to SD card? This will overwrite /config.ini.')) {
        fetch('/save-config').then(r => r.text()).then(t => { alert(t); });
      }
    }
    var paused = false;
    function toggleConfigPanel() {
      var el = document.getElementById('configPanel');
      el.classList.toggle('visible');
      paused = el.classList.contains('visible');
    }
    var uploading = false;
    function toggleUpload() {
      var el = document.getElementById('uploadForm');
      el.classList.toggle('visible');
      paused = el.classList.contains('visible');
    }
    document.getElementById('configUploadForm').addEventListener('submit', function(e) {
      e.preventDefault();
      uploading = true;
      var status = document.getElementById('configUploadStatus');
      status.innerHTML = '<p style="color:#ff8800;">Uploading config... please wait.</p>';
      var formData = new FormData(this);
      var reboot = document.getElementById('configReboot').checked;
      var url = '/upload-config' + (reboot ? '?reboot=1' : '');
      fetch(url, { method: 'POST', body: formData })
        .then(r => r.json())
        .then(d => {
          if (d.success) {
            status.innerHTML = '<p style="color:#00ff88;">' + d.message + '</p>';
            if (d.rebooting) {
              status.innerHTML += '<p style="color:#ff8800;">Rebooting in 3 seconds...</p>';
              setTimeout(() => location.reload(), 12000);
            } else {
              setTimeout(() => { uploading = false; location.reload(); }, 2000);
            }
          } else {
            status.innerHTML = '<p style="color:#ff4444;">' + d.message + '</p>';
            uploading = false;
          }
        })
        .catch(() => {
          status.innerHTML = '<p style="color:#ff4444;">Upload failed - connection error.</p>';
          uploading = false;
        });
    });
    document.getElementById('firmwareForm').addEventListener('submit', function(e) {
      e.preventDefault();
      uploading = true;
      var progress = document.getElementById('uploadProgress');
      progress.innerHTML = '<p style="color:#ff8800;">Uploading firmware... please wait.</p>';
      var formData = new FormData(this);
      fetch('/update', { method: 'POST', body: formData })
        .then(r => r.text())
        .then(html => {
          progress.innerHTML = '<p style="color:#00ff88;">Upload complete! Rebooting device...</p><p style="color:#888;">Page will reload in 15 seconds.</p>';
          setTimeout(() => { uploading = false; location.reload(); }, 15000);
        })
        .catch(() => {
          progress.innerHTML = '<p style="color:#00ff88;">Firmware uploaded. Device is rebooting...</p><p style="color:#888;">Page will reload in 15 seconds.</p>';
          setTimeout(() => { uploading = false; location.reload(); }, 15000);
        });
    });
    setInterval(function() { if (!uploading && !paused) location.reload(); }, 5000);
  </script>
</body>
</html>
)rawhtml";

  // Replace placeholders
  html.replace("%WIFI_COLOR%", state.wifiConnected ? (state.wifiRSSI > -70 ? "green" : (state.wifiRSSI > -80 ? "yellow" : "red")) : "red");
  html.replace("%RSSI%", String(state.wifiRSSI));
  html.replace("%MQTT_COLOR%", state.mqttConnected ? "green" : "red");
  html.replace("%MQTT_STATUS%", state.mqttConnected ? "Connected" : "Disconnected");

