RandMental/LTC---4-Zone-Temperature-Controller/ESP32_Victron_Dual_DS1820_MQTT_7735_v2/ESP32_Victron_Dual_DS1820_MQTT_7735_v2.ino
  // Timestamp
  struct tm timeinfo;
  char timeStr[20] = "N/A";
  if (getLocalTime(&timeinfo)) {
    strftime(timeStr, sizeof(timeStr), "%Y-%m-%d %H:%M:%S", &timeinfo);
  }
  html.replace("%TIMESTAMP%", String(timeStr));

  // Ambient data
  if (state.ambientTemp.valid) {
    char ambTempStr[10];
    snprintf(ambTempStr, sizeof(ambTempStr), "%.1f&deg;C", state.ambientTemp.filtered);
    html.replace("%AMB_TEMP%", String(ambTempStr));
  } else {
    html.replace("%AMB_TEMP%", "--.-&deg;C");
  }

  if (state.ambientHum.valid) {
    char ambHumStr[10];
    snprintf(ambHumStr, sizeof(ambHumStr), "%.0f%%", state.ambientHum.filtered);
    html.replace("%AMB_HUM%", String(ambHumStr));
  } else {
    html.replace("%AMB_HUM%", "--%");
  }

  // Footer info
  html.replace("%VERSION%", FIRMWARE_VERSION);

  uint32_t uptime = (millis() - state.bootTime) / 1000;
  uint32_t days = uptime / 86400;
  uint32_t hours = (uptime % 86400) / 3600;
  uint32_t minutes = (uptime % 3600) / 60;
  char uptimeStr[32];
  snprintf(uptimeStr, sizeof(uptimeStr), "%lud %luh %lum", days, hours, minutes);
  html.replace("%UPTIME%", String(uptimeStr));

  html.replace("%HEAP%", String(ESP.getFreeHeap()));
  html.replace("%BOOTCOUNT%", String(state.bootCount));

  return html;
}

/**
 * @brief Handle root page request
 */
void handleRoot(AsyncWebServerRequest* request) {
  request->send(200, "text/html", generateHtmlPage());
}

/**
 * @brief Handle fan test request
 */
void handleFanTest(AsyncWebServerRequest* request) {
  if (state.operatingMode == MODE_NORMAL) {
    enterTestFansMode();
    request->send(200, "text/plain", "Fan test started - all fans will run for 5 seconds");
  } else {
    request->send(503, "text/plain", "System busy - try again later");
  }
}

/**
 * @brief Handle save config to SD card request
 */
void handleSaveConfig(AsyncWebServerRequest* request) {
  if (writeConfigToSD()) {
    request->send(200, "text/plain", "Config saved to SD card as /config.ini");
  } else {
    request->send(500, "text/plain", "Failed to write config - check SD card");
  }
}

// Temporary file handle for config upload
static File configUploadFile;

/**
 * @brief Handle config.ini file upload data chunks
 * Writes uploaded data directly to /config.ini on SD card
 */
void handleConfigUpload(AsyncWebServerRequest* request, String filename, size_t index, uint8_t* data, size_t len, bool final) {
  if (index == 0) {
    LOG_INFO("Config upload started: %s", filename.c_str());
    displayOtaStatus("Uploading", "Config.ini...", COLOR_YELLOW);
    if (!cfg.sdCardPresent) {
      LOG_ERROR("Config upload failed: no SD card");
      displayOtaStatus("Config Upload", "No SD Card!", COLOR_RED);
      return;
    }
    configUploadFile = SD.open("/config.ini", FILE_WRITE);
    if (!configUploadFile) {
      LOG_ERROR("Config upload failed: cannot open /config.ini for writing");
      displayOtaStatus("Config Upload", "Write Failed!", COLOR_RED);
      return;
    }
  }

  if (configUploadFile) {
    configUploadFile.write(data, len);
  }

  if (final) {
    if (configUploadFile) {
      configUploadFile.close();
      LOG_INFO("Config upload complete (%u bytes)", index + len);
      displayOtaStatus("Config.ini", "Saved to SD", COLOR_GREEN);
    }
  }
}

/**
 * @brief Handle config upload completion - apply config and optionally reboot
 */
void handleConfigUploadComplete(AsyncWebServerRequest* request) {
  bool reboot = request->hasParam("reboot") && request->getParam("reboot")->value() == "1";

  if (!cfg.sdCardPresent) {
    request->send(500, "application/json", "{\"success\":false,\"message\":\"No SD card present\",\"rebooting\":false}");
    return;
  }

  // Reload config from the newly uploaded file
  loadConfigFromSD();
  buildMqttTopics();
  fanOnState = cfg.fanActiveLow ? LOW : HIGH;
  fanOffState = cfg.fanActiveLow ? HIGH : LOW;
  LOG_INFO("Config reloaded from uploaded file");

  char json[128];
  if (reboot) {
    snprintf(json, sizeof(json), "{\"success\":true,\"message\":\"Config saved and loaded. Rebooting...\",\"rebooting\":true}");
    request->send(200, "application/json", json);
    displayOtaStatus("Rebooting...", "", COLOR_GREEN);
    delay(3000);
    ESP.restart();
  } else {
    snprintf(json, sizeof(json), "{\"success\":true,\"message\":\"Config saved and applied (no reboot).\",\"rebooting\":false}");
    request->send(200, "application/json", json);
  }
}

/**
 * @brief Handle sensor assignment mode request
 */
void handleAssignSensors(AsyncWebServerRequest* request) {
  if (state.operatingMode == MODE_NORMAL) {
    enterSensorAssignmentMode();
    request->send(200, "text/plain", "Sensor assignment mode started - use touchscreen to assign sensors");
  } else {
    request->send(503, "text/plain", "System busy - try again later");
  }
}

/**
 * @brief Handle 404 not found
 */
void handleNotFound(AsyncWebServerRequest* request) {
  request->send(404, "text/plain", "Not Found");
}

/**
 * @brief Handle firmware upload data chunks
 */
void handleFirmwareUpload(AsyncWebServerRequest* request, String filename, size_t index, uint8_t* data, size_t len, bool final) {
  if (index == 0) {
    LOG_INFO("Firmware update started: %s", filename.c_str());
    displayOtaStatus("Uploading", "Firmware...", COLOR_YELLOW);
    if (!Update.begin(UPDATE_SIZE_UNKNOWN)) {
      LOG_ERROR("Update begin failed: %s", Update.errorString());
      displayOtaStatus("Firmware", "Upload Failed!", COLOR_RED);
      return;
    }
  }

  if (Update.write(data, len) != len) {
    LOG_ERROR("Update write failed: %s", Update.errorString());
    displayOtaStatus("Firmware", "Write Failed!", COLOR_RED);
    return;
  }

  if (final) {
    displayOtaStatus("Flashing", "Firmware...", COLOR_CYAN);
    if (Update.end(true)) {
      LOG_INFO("Firmware update complete (%u bytes)", index + len);
    } else {
      LOG_ERROR("Update end failed: %s", Update.errorString());
      displayOtaStatus("Firmware", "Flash Failed!", COLOR_RED);
    }
  }
}

/**
 * @brief Handle firmware upload completion and reboot
 */
void handleFirmwareUploadComplete(AsyncWebServerRequest* request) {
  bool success = !Update.hasError();

  String html = R"rawhtml(
<!DOCTYPE html>
<html>
<head>
  <meta charset="UTF-8">
  <title>Firmware Update</title>
  <style>
    body { font-family: sans-serif; background: #1a1a2e; color: #eee; display: flex; justify-content: center; align-items: center; min-height: 100vh; margin: 0; }
    .card { background: #16213e; padding: 40px; border-radius: 12px; text-align: center; max-width: 400px; }
    .success { color: #00ff88; }
    .error { color: #ff4444; }
    h1 { margin-bottom: 20px; }
    p { color: #888; }
  </style>
</head>
<body>
  <div class="card">
)rawhtml";

  if (success) {
    html += R"rawhtml(
    <h1 class="success">Update Successful!</h1>
    <p>Device is rebooting...</p>
    <p>Page will reload in 10 seconds.</p>
    <script>setTimeout(() => location.href = '/', 10000);</script>
)rawhtml";
  } else {
    html += R"rawhtml(
    <h1 class="error">Update Failed!</h1>
    <p>)rawhtml";
    html += Update.errorString();
    html += R"rawhtml(</p>
    <p><a href="/" style="color: #00aaff;">Return to home</a></p>
)rawhtml";
  }

  html += "</div></body></html>";

  request->send(success ? 200 : 500, "text/html", html);

  if (success) {
    displayOtaStatus("Rebooting...", "", COLOR_GREEN);
    delay(1000);
    ESP.restart();
  }
}

/**
 * @brief Initialize the async web server
 */
void initWebServer() {
  if (webServerInitialized) return;

  // Main page
  webServer.on("/", HTTP_GET, handleRoot);

  // Fan test endpoint
  webServer.on("/test-fans", HTTP_GET, handleFanTest);

  // Sensor assignment endpoint
  webServer.on("/assign-sensors", HTTP_GET, handleAssignSensors);

  // Save config to SD card endpoint
  webServer.on("/save-config", HTTP_GET, handleSaveConfig);

  // Config file upload endpoint
  webServer.on("/upload-config", HTTP_POST, handleConfigUploadComplete, handleConfigUpload);

