RandMental/LTC---4-Zone-Temperature-Controller/ESP32_Victron_Dual_DS1820_MQTT_7735_v2/ESP32_Victron_Dual_DS1820_MQTT_7735_v2.ino
  // Firmware update endpoints
  webServer.on("/update", HTTP_POST, handleFirmwareUploadComplete, handleFirmwareUpload);

  // 404 handler
  webServer.onNotFound(handleNotFound);

  webServer.begin();
  webServerInitialized = true;

  LOG_INFO("Web server started on port 80");
  LOG_INFO("Access at http://%s/", WiFi.localIP().toString().c_str());
}

// ================================ SETUP ================================
void setup() {
  Serial.begin(115200);
  delay(100);  // Brief delay for serial to stabilize

  Serial.println("\n========================================");
  Serial.println("   Victron Temperature Monitor");
  Serial.println("   ESP32-S3-DevKitC-1");
  Serial.printf("   Version: %s\n", FIRMWARE_VERSION);
  Serial.printf("   Built: %s %s\n", BUILD_DATE, BUILD_TIME);
  Serial.printf("   Sensors: %d, Fans: %d\n", NUM_TEMP_SENSORS, NUM_FANS);
  Serial.println("========================================\n");

  // 1. Initialize runtime config from compiled defaults
  initConfigDefaults();

  state.init();
  displayCache.init();
  state.bootTime = millis();

  loadPreferences();
  savePreferences();

  // 2. Deselect all SPI CS pins HIGH before any SPI init
  pinMode(TFT_CS, OUTPUT);
  digitalWrite(TFT_CS, HIGH);
  pinMode(TCH_CS, OUTPUT);
  digitalWrite(TCH_CS, HIGH);
  pinMode(SD_CS_PIN, OUTPUT);
  digitalWrite(SD_CS_PIN, HIGH);

  // 3. Watchdog and display hardware init
  initWatchdog();
  initDisplay();
  initTouch();
  feedWatchdog();

  // 4. SD card: init, load config, build MQTT topics
  initSDCard();
  loadConfigFromSD();
  buildMqttTopics();
  feedWatchdog();

  // 5. Apply runtime fan polarity from config
  fanOnState = cfg.fanActiveLow ? LOW : HIGH;
  fanOffState = cfg.fanActiveLow ? HIGH : LOW;

  // 6. Re-apply rotation if SD card changed it
  tft.setRotation(cfg.tftRotation);

  // 7. Init relays (uses runtime fan polarity)
  initRelays();
  feedWatchdog();

  // 8. Load sensor addresses: NVS > SD card > compiled defaults
  loadSensorAddresses();

  // 9. Show startup screen with SD card status
  displayStartupScreen();
  delay(STARTUP_SCREEN_MS);
  feedWatchdog();

  // 10. Check if no valid addresses - auto-enter assignment mode
  if (!hasStoredSensorAddresses()) {
    LOG_INFO("No valid sensor addresses - entering assignment mode");
    enterSensorAssignmentMode();

    // Run assignment mode loop until complete
    while (state.operatingMode != MODE_NORMAL) {
      feedWatchdog();
      switch (state.operatingMode) {
        case MODE_SENSOR_CLEAR_BUS:
          handleClearBusMode();
          break;
        case MODE_SENSOR_ASSIGNMENT:
          handleSensorAssignmentMode();
          break;
        default:
          break;
      }
      delay(100);
    }
  }

  state.operatingMode = MODE_NORMAL;

  initSensors();
  feedWatchdog();

  initWiFi();
  feedWatchdog();

  initNTP();

  // Prime sensor readings
  for (int i = 0; i < 3; i++) {
    readAllSensors();
    delay(400);
    feedWatchdog();
  }

  tft.fillScreen(COLOR_BLACK);  // Clear startup screen artifacts
  displayCache.init();          // Reset cache to force full redraw
  updateDisplay();
  LOG_INFO("Setup complete");
}

// ================================ LOOP ================================
void loop() {
  uint32_t currentTime = millis();

  feedWatchdog();
  // updateRgbLed();  // Disabled - too bright

  // Handle button/touch input in normal mode
  if (state.operatingMode == MODE_NORMAL) {
    bool isPressed = isInputActive();

    // Check for 5-second hold to enter assignment mode (don't wait for release)
    if (isPressed && state.buttonPressed) {
      uint32_t holdDuration = currentTime - state.buttonPressStartTime;
      if (holdDuration >= LONG_PRESS_MS) {
        // 5 seconds held - enter assignment mode immediately
        LOG_INFO("5s hold detected - entering assignment mode");
        state.buttonPressed = false;  // Reset button state
        enterSensorAssignmentMode();
        return;
      }
    }

    // Normal button handling (for short press to test fans)
    uint8_t btn = checkButton();
    if (btn == 1) {
      // Short press (<1s) - test fans
      enterTestFansMode();
    }
    // Note: btn==3 (long press) is now handled above while still pressed
  }

  // Handle special modes
  switch (state.operatingMode) {
    case MODE_TEST_FANS:
      handleTestFansMode();
      feedWatchdog();
      return;  // Skip normal processing

    case MODE_SENSOR_CLEAR_BUS:
      handleClearBusMode();
      feedWatchdog();
      return;

    case MODE_SENSOR_ASSIGNMENT:
      handleSensorAssignmentMode();
      feedWatchdog();
      return;

    case MODE_NORMAL:
    default:
      break;  // Continue with normal loop
  }

  handleWiFi();
  feedWatchdog();

  updateHeapStats();

  // Initialize MQTT and Web Server when WiFi connects
  static bool mqttInitialized = false;
  if (state.wifiConnected && !mqttInitialized) {
    LOG_INFO("Initializing MQTT and Web Server...");
    initMQTT();
    feedWatchdog();
    initWebServer();
    feedWatchdog();
    mqttInitialized = true;
    LOG_INFO("MQTT and Web Server initialized");
  }
  if (!state.wifiConnected) {
    mqttInitialized = false;
    state.mqttConnected = false;
  }

  // Only check MQTT connection if initialized
  if (mqttInitialized) {
    state.mqttConnected = mqttClient.isConnected();
  }
  feedWatchdog();

  // Read sensors (non-blocking)
  if ((uint32_t)(currentTime - state.lastSensorRead) >= cfg.sensorInterval) {
    state.lastSensorRead = currentTime;
    readAllSensors();
    feedWatchdog();
    updateFans();
  }

  // Update display + check SD card
  if ((uint32_t)(currentTime - state.lastDisplayUpdate) >= cfg.displayInterval) {
    state.lastDisplayUpdate = currentTime;
    checkSDCard();
    updateDisplay();
    feedWatchdog();
  }

  // Publish telemetry
  if ((uint32_t)(currentTime - state.lastMQTTPublish) >= cfg.mqttInterval) {
    state.lastMQTTPublish = currentTime;
    if (state.mqttConnected) {
      publishTelemetry();
    }
    feedWatchdog();
  }

  // Publish status
  if ((uint32_t)(currentTime - state.lastStatusPublish) >= cfg.statusInterval) {
    state.lastStatusPublish = currentTime;
    if (state.mqttConnected) {
      publishStatus();
    }
    feedWatchdog();
  }

  // Sync NTP
  if ((uint32_t)(currentTime - state.lastNTPSync) >= cfg.ntpInterval) {
    state.lastNTPSync = currentTime;
    syncNTP();
    feedWatchdog();
  }

  delay(10);
}

/*
 * =============================================================================
 * DS18B20 Address Scanner
 * =============================================================================
 * Upload this sketch separately to discover your sensor addresses.
 * Copy the printed addresses to the sensorAddresses array above.
 *
 * #include <OneWire.h>
 *
 * OneWire ds(4);  // GPIO 4 (ESP32-S3)
 *
 * void setup() {
 *   Serial.begin(115200);
 *   Serial.println("\n=== DS18B20 Address Scanner ===\n");
 * }
 *
 * void loop() {
 *   byte addr[8];
 *
 *   if (!ds.search(addr)) {
 *     Serial.println("\nScan complete. Restarting in 5 seconds...\n");
 *     ds.reset_search();
 *     delay(5000);
 *     return;
 *   }
 *
 *   if (OneWire::crc8(addr, 7) != addr[7]) {
 *     Serial.println("CRC error - bad connection?");
 *     return;
 *   }
 *
 *   Serial.print("  { ");
 *   for (int i = 0; i < 8; i++) {
 *     Serial.print("0x");
 *     if (addr[i] < 16) Serial.print("0");
 *     Serial.print(addr[i], HEX);
 *     if (i < 7) Serial.print(", ");
 *   }
 *   Serial.println(" },");
 *
 *   delay(1000);
 * }
 * =============================================================================
 */
